Repository: KuroiAme/devilry-django
Catalog: devilry/locale/*/LC_MESSAGES/django.po
Languages: nb

source: No tags registered on the semester. If you add tags, you can organize examiners and students based on the tags.
nb: Ingen tags lagt til for semesteret. Hvis du legger til tags, kan du organisere rettere og studenter etter disse.

source: Add semester tags
nb: Legg til tags for semesteret

source: Tags exist for the semester, but is missing either examiners, students or both.
nb: Tags eksisterer for semesteret, men mangler enten retter, student eller begge.

source: Manage tags
nb: Administrer tags

source: Organize
nb: Organiser

source: Organize examiners randomly
nb: Organiser rettere tilfeldig

source: Select one or more students and select the examiners you want to randomly assign to the selected students.
nb: Velg en eller flere studenter og velg retterene som du vil tildele tilfeldig til de valgte studentene.

source: How would you like to bulk-organize your examiners?
nb: Hvordan vil du bulk-organisere dine rettere?

source: Back to examiner overview
nb: Tilbake til oversikt for retter

source: warning
nb: advarsel

# devilry admin assignment examiner bulk organize
source: There are still students on the assignment with no examiners assigned to them
nb: Det er fortsatt studenter på oppgaven som ikke har blitt tildelt retter

source: Select students and randomly assign two or more examiners to those students
nb: Velg studenter og tildel tilfeldig to eller flere rettere til de studentene

source: Select students and add examiners to those students
nb: Velg studenter og legg rettere til disse studentene

source: Select students and replace examiners for those students
nb: Velg studenter og erstatt rettere for disse studentene

source: Tip:
nb: Tips:

source: Go back to the examiner overview and select an examiner if you want to edit students for a single examiner in a more controlled manner.
nb: Gå tilbake til oversikten av rettere og velg en retter hvis du ønsker å redigere studenter for en enkelt retter på en mer kontrollert måte.

source: %(examiner)s - examiner
nb: %(examiner)s - retter

source: Add students
nb: Legg til studenter

source: Remove some or all students
nb: Fjern noen eller alle studentene

source: Examiners on %(assignmentname)s
nb: Rettere for %(assignmentname)s

source: Back to assignment overview
nb: Tilbake til oversikt for oppgaver

source: You can bulk-organize examiners using the button below, or click on an examiner to manually organize students for each examiner.
nb: Du kan bulk-organisere retter ved å benytte knappen nedenfor, eller klikke på en retter for manuell organiseringer av studenter for hver retter.

# devilry admin assignment examineroverview
source: There are still students on the assignment with no examiners assigned to them
nb: Det er fortsatt studenter på oppgaven som ikke har blitt tildelt retter

source: You have no users registered as examiner for %(period)s. You need to add users as examiners on the semester page for the course before you can use them as examiners for assignments.
nb: Du har ingen brukere registrert som rettere for %(period)s. Du trenger å legge til brukere som rettere på kursets semesterside før du benytter de som retter for en oppgave.

source: Add examiners
nb: Legg til rettere

source: Bulk-organize examiners
nb: Bulk-organisere rettere

source: Only users registered as examiner for %(period)s is available as examiners for assignments.
nb: Kun brukere registrert som rettere for %(period)s er tilgjengelige som rettere for oppgaver.

source: Add more examiners
nb: Legg til flere rettere

source: Remove students from %(examiner)s
nb: Fjern studenter fra %(examiner)s

source: Setup how you wish to map points to grade. Specify the grade in the first column, and the minimum number of points required to get that grade in the second column. The first row always has the value 0 in the second column, and this is not editable.
nb: Definer hvordan du ønsker å linke poeng til karakter. Spesifiser karakteren i den første kolonnen og den minimale poengsum for å oppnå karakteren i den andre kolonnen. Den første raden må ha verdien 0 i den andre kolonnen. Dette kan ikke redigeres.

source: Grade
nb: Karakter

source: Minimum points required for grade
nb: Minimum antall poeng nødvendig for å bestå

source: Add row
nb: Legg til rad

source: Setup A-F example
nb: Sett opp A-F eksempel

source: Back
nb: Tilbake

source: Manage examiners
nb: Administrer rettere

# No examiners configured message
source: No examiners configured
nb: Ingen rettere er konfigurert

source: %(examiners_count)s examiner(s) configured
nb: %(examiners_count)s rettere konfigurert

# devilry admin assignment overview examiner
source: Go to the semester page and add/activate examiners
nb: Gå til semestersiden og legg til/aktiver rettere

# devilry admin assignment overview examiner
source: There are students with no examiners assigned to them
nb: Det finnes studenter som ikke er tilordnet retter

# devilry admin assignment overview examiner
source: Configure examiners
nb: Konfigurer rettere

# devilry admin assignment overview examiner
source: No examiners configured
nb: Ingen rettere er konfigurert

source: Only configured examiners can see and correct deliveries from students.
nb: Kun konfigurerte retter kan se og rette innleveringer fra studenter.

source: note
nb: notis

# devilry admin assignment overview examiner
source: There are examiners on the semester that are not assigned to any students
nb: Det er fortsatt rettere som er på semesteret men som ikke er tilordnet studenter

source: Grading configuration
nb: Konfigurasjon for karaktersetting

source: Examiner chooses
nb: Retter velger

source: Students see
nb: Studenter ser

source: or
nb: eller

source: Points awarded for passing grade
nb: Belønnede poeng for karakteren bestått

source: Maximum number of points achievable
nb: Maksimalt antall poeng oppnåelig

source: Minimum number of points required to pass
nb: Minimum antall poeng nødvendig for å bestå

source: Edit grading configuration
nb: Rediger karaktersetting-konfigurasjon

source: Will be published:
nb: Vil bli publisert:

source: Students and examiners will not see the assignment before it is published.
nb: Studenter og rettere vil ikke se oppgaven før den er publisert.

source: Was published:
nb: Ble publisert:

source: This assignment is now avaibable for both students and examiners
nb: Denne oppgaven er nå tilgjengelig for både studenter og rettere

source: Publish now
nb: Publiser nå

source: Edit publishing time
nb: Rediger publiseringstidspunkt

source: First deadline
nb: Første innleveringsfrist

# first_deadline description
source: The first deadline is %(deadline)s. This deadline is common for all students unless a new deadline have been provided to a group.
nb: Første innleveringsfrist er %(deadline)s. Denne fristen er felles for alle studenter, med unntak av grupper som er blitt tildelt en annen innleveringsfrist.

source: Edit first deadline
nb: Rediger første innleveringsfrist

source: Project groups
nb: Prosjektgrupper

source: Student can create project groups on their own.
nb: Studenter kan opprette prosjektgrupper på egenhånd.

source: Students can not create project groups on their own. As an administrator you are able to create the groups in the "Students" overview.
nb: Studenter kan ikke lage prosjektgrupper på egenhånd. Som en administrator kan du opprette grupper i oversikten for "Studenter".

source: Edit project group settings
nb: Rediger innstillinger for prosjektgruppe

source: Anonymization
nb: Anonymisering

source: Edit anonymization mode
nb: Rediger anonymiseringsmodus

source: SOFT. Students can add deliveries and comment after the deadline has expired.
nb: MYK. Studenter kan laste opp innleveringer og kommentere etter fristen.

source: HARD. Students can not add deliveries or comment after the deadline has expired.
nb: HARD. Studenter kan ikke laste opp innleveringer eller kommentere etter fristen.

source: Edit deadline handling
nb: Rediger håndtering av innleveringsfrister

# admin assignment overview
source: You do not have access to change this setting.
nb: Du har ikke tilgang til å endre denne innstillingen.

source: Manage students
nb: Administrer studenter

source: %(num_candidates)s students organized in %(num_groups)s project groups
nb: %(num_candidates)s studenter organisert i %(num_groups)s prosjektgrupper

source: No students on the assignment
nb: Ingen studenter på oppgaven

source: Go to the semester page and add/activate students
nb: Gå til semestersiden og legg til/aktiver studenter

# devilry admin assignment overview student
source: No students added to the assignment
nb: Det er ingen studenter tilknyttet oppgaven

# devilry admin assignment overview student
source: Add students
nb: Legg til studenter

# devilry admin assignment overview student
source: Only students added to an assignment can see the assignment and add deliveries
nb: Kun studenter på oppgaven kan legge se oppgaven og legge til innleveringer

# devilry admin assignment overview student
source: There are students who are on the semester, but not on the assignment
nb: Det er fortsatt studenter som er tilknyttet semesteret, men som ikke er tilknyttet oppgaven

source: Passed previous semester
nb: Bestått tidligere semester

source: Mark students that have passed this assignment previously.
nb: Marker studenter som har bestått denne oppgaven tidligere.

source: Edit passed previous semester
nb: Rediger bestått tidligere semester

source: preparing download
nb: forbereder nedlasting

source: Download assignment
nb: Last ned oppgave

source: download is ready
nb: nedlasting er klar

source: Edit name
nb: Rediger navn

source: (max points/passing grade)
nb: (maksimum poeng/bestått karakter)

source: (semester start/semester end)
nb: (semesterstart/semesterslutt)

source: Back to period select
nb: Tilbake til valg for periode

source: Step 2 of 3: Confirm assignments
nb: Steg 2 av 3: Bekreft oppgaver

source: These Assignments will be taken into account
nb: Følgende oppgaver tas i betraktning

source: upon approval of passing grade this semester.
nb: ved godkjenning av bestått karakter for dette semesteret.

source: In this step you get a preview of all assignments that matches the current assignment to import results to. You can see which semester the assignments belong to, max/min points and the start and end time of the semester.
nb: På dette steget får en forhåndsvisning av alle oppgaver som matcher oppgaven det skal importeres resultater til. Du kan se hvilke semester oppgavene tilhører, maks/min poeng og start og slutt tid for semesteret.

source: On the next step you will get a preview of all students that will be passed for the current assignment and confirm the results.
nb: På neste steg vil du få en forhåndsvisning av alle studenter som vil få bestått på oppgaven og mulighet for å bekrefte resultatene.

source: Next
nb: Neste

source: Back to confirm assignments
nb: Tilbake til bekreft oppgaver

source: Step 3 of 3: Approve assignments for the following students.
nb: Steg 3 av 3: Godkjenn oppgaver for følgende studenter.

source: Here is a list of previous passed assignments delivered by students.
nb: Her er en liste av tidligere beståtte oppgaver levert av studenter.

source: If the old grading configuration varies from the current the points will be converted as shown.
nb: Hvis den forrige konfigurasjonen av karaktersetting varierer fra den nåværende, vil poengene konverteres som vist.

source: This is the final step, and you can see a preview of all the students on the current assignment that will get a passing grade, which assignment the result is fetched from and how the score is converted.
nb: Dette er det siste steget, og du kan se en forhåndsvisning av alle studenter på nåværende oppgave som vil få bestått, hvilke oppgave resultatet kommer fra og hvordan poengene er konvertert.

source: The best results from the assignments are used, so if a student failed all but one of the earlier assignments, they will still get a passing grade.
nb: De beste resultatene fra oppgaven blir brukt, so hvis en student feilet alle bortsett fra en oppgave, vil de fremdeles få bestått.

source: Select how you want to pass students in the context that they have passed this assignment on a previous semester. We recommend that you do this before examiners starts to correct deliveries. Select one of the modes below.
nb: Velg hvordan du vil godkjenne studenter som har bestått denne oppgaven i et tidligere semester. Vi anbefaler at dette blir gjort før innleveringer for dette semester blir rettet. Velg en av modus nedenfor.

# passed previous semester
source: Unsupported grading plugin
nb: Karakterkonfigurasjonen er ikke støttet

source: The grading plugin for this assignment is currently not supported. This will only work for assignments that uses the passed/failed plugin.
nb: Konfigurasjonen for karaktersetting på denne oppgaven er for øyeblikket ikke støttet. Kun oppgaver som bruker karakterkonfigurasjonen bestått/ikke bestått er støttet.

source: Step 1 of 3: select the earliest semester you want to approve for
nb: Steg 1 av 3: velg det tidligste semesteret du vil godkjenne for

source: Everything from the selected period will be included,
nb: Alt fra den valgte perioden vil bli inkludert,

source: and not any assignments that were done before the selected period
nb: og ingen oppgaver som var ferdige før den valgte perioden

source: In this step you will get a list of semesters that include an assignment with short name "%(short_name)s". You must select the earliest semester you want to get student results from, which means that all assignment results from semesters after and including the one you selected are taken into account when fetching the results.
nb: På dette steget vil du få en liste av semestre som inkluderer oppgaver med navnet "%(short_name)s". Du må velge det tidligste semesteret du vil hente resultater fra, som betyr at vi henter resultater fra alle oppgavene fra semesteret du valgte og frem til nå.

source: On the next step you will get a preview of all assignments collected from the selected semesters, and information about which semesters the assignments belongs to and so on.
nb: På det neste steget vil få en forhåndsvisning av alle oppgaver hentet fra de valgte semesterene, og informasjon om hvilket semestre oppgavene ble hentet fra.

source: There are no prior semesters connected to this assignment.
nb: Det er ingen tidligere semestere knyttet til denne oppgaven.

source: Back to assignment dashboard page
nb: Tilbake til oppgave oversikten

source: Pass students.
nb: Godkjenn studenter.

source: Select the students you want to pass. Note that all the students are available here, so the previous result of a student will be overwritten.
nb: Velg studentene du vil godkjenne oppgaver for. Pass på, alle studenter er tilgjengelige her, så tidligere resultater vil bli overskrevet.

source: All students
nb: Alle studenter

source: Students with passing grade
nb: Studenter med karakteren bestått

source: Back to student overview
nb: Tilbake til oversikt av studenter

# admin create_groups
source: Select manually
nb: Velg manuelt

source: Back to add students overview
nb: Tilbake til oversikt for legg til studenter

source: You selected
nb: Du valgte

source: No students matching your selection found.
nb: Fant ingen studenter som samsvarer med ditt valg.

# admin create_groups
source: No students found.
nb: Fant ingen studenter.

source: You can add more students on the semester page.
nb: Du kan legge til flere studenter på semestersiden.

source: Delete students
nb: Slett studenter

source: Back to delete students overview
nb: Tilbake til oversikt for å slette studenter

source: Select one or more students, and click the "Delete students" button.
nb: Velg en eller flere studenter, og trykk på "Slett studenter" knappen.

source: You do not have permission to delete students with deliveries and/or feedback, so those students are not available in the list below.
nb: Du har ikke tillatelse til å slette studenter med leveringer/tilbakemeldinger, så de studentene er ikke synlige i listen nedenfor.

source: You have permission to delete students with deliveries and/or feedback, so be VERY CAREFUL before you click the delete button!
nb: Du har tillatelse til å slette studenter med leveringer/tilbakemeldinger. Vær VEDLIG FORSIKTIG før du klikker på sletteknappen!

# devilry admin assignment delete students
source: Published
nb: Publisert

# admin delete groups confirm
source: The students listed below are the students on the current assignment that failed %(from_assignment)s, and are ready to be deleted. Some students may be excluded based on the following criteria
nb: Studentene listet under er studenter på denne oppgaven som ikke bestod %(from_assignment)s, og er klare for å bli slettet. Noen student kan bli ekskludert fra slettingen basert på følgende kriterier

# admin delete groups confirm
source: Last attempt not graded
nb: Siste forsøk er ikke rettet

# admin delete groups confirm
source: Simply means that whether or not they have multiple attempts, the last attempt is not corrected and therefore not counted as failed.
nb: Uavhengig av hvor mange forsøk studenten har, så er ikke siste forsøk rettet og anses ikke som et feilet forsøk.

# admin delete groups confirm
source: More than one student
nb: Mer enn én student

# admin delete groups confirm
source: If a project group on the current assignment has more than one student (a collaborative group). You can still delete this project group manually, or split and then delete if you only want to delete one of the students in the project group.
nb: Hvis en gruppe på oppgaven har mer enn én student. Du kan fortsatt slette denne gruppen manuelt, eller splitte og deretter slette hvis du kun vil slette en av studentene.

# admin delete groups confirm
source: Manually delete groups
nb: Slette grupper manuelt

source: View feedback details
nb: Vis detaljer for tilbakemelding

source: Split group
nb: Del gruppe

source: Details
nb: Detaljer

source: No students found matching your filters/search.
nb: Ingen studenter samsvarer med dine filtre/søk.

source: No students.
nb: Ingen studenter.

source: Organize students in project groups
nb: Organiser studenter i prosjektgrupper

source: The first selected group will be the group to merge into, Then select one or more groups to be merged into the first selected.
nb: Velg først gruppen hvor andre grupper skal flettes inn. Deretter velg en eller flere grupper som skal flettes inn i den som først ble valgt.

source: Click "Create project group" to create a group containing all the students in the selected groups.
nb: Klikk "Opprett prosjektgruppe" for å opprette en gruppe som inneholder alle studenter fra de valgte gruppene.

source: Only put students in a project group if you want those students to cooperate on the assignments.
nb: Sett studenter i en prosjektgruppe kun når du ønsker at disse studentene skal samarbeide på oppgavene.

source: They will deliver together, and all feedback and grading is shared, Also previous existing feedback and comments on the assignment will also be shared.
nb: De leverer sammen, og alle tilbakemeldinger og karakterer er delt. Videre blir tidligere tilbakemeldinger og kommenterer som fortsatt eksisterer for oppgaven bli delt.

source: Students on %(assignmentname)s
nb: Studenter i %(assignmentname)s

source: Remove students
nb: Fjern studenter

source: Manage deadlines
nb: Håndter innleveringsfrister

source: Back to feedback feed
nb: Tilbake til innleveringsoversikt

source: Split students from project group
nb: Del studenter fra prosjektgruppe

source: Select the student to split from project group
nb: Velg studenten som skal splittes fra prosjektgruppen

source: Please verify that the emails you add below match existing users in Devilry to avoid generating new users.
nb: Vennligst verifiser at epostene du legger til under hører til eksisterende brukere i Devilry for å unngå at nye brukere blir opprettet.

source: Inherited administrators
nb: Arvede administratorer

source: The following administrators is inherited from higher up in the hierarchy.
nb: Følgende administratorer er arvet fra høyere opp i hierarkiet.

source: Contact at %(email)s
nb: Kontakt på %(email)s

source: How the administrator permission system works
nb: Hvordan rettighetssystemet for administratorer fungerer

source: Administrators are organized in permission groups. There is three types of permission groups:
nb: Administratorer er organisert i grupper med tillatelser. Det er tre ulike tillatelsesgrupper:

source: Department administrator
nb: Avdelingsadministrator

source: Department administrator permission groups is the highest level of permission except for superusers (which have access to everything). These permission groups is added to multiple courses, typically all courses within a department.
nb: Tillatelsesgrupper for avdelingsadministrator en den høyeste graden av tillatelse unntatt superbrukere (som har adgang til alt). Disse tillatelsesgruppene er lagt til for flere kurs, typisk for alle kurs tilhørende en avdeling.

source: Users within a department administrator permission group have access to everything, including some data and operations that is unavailable to course administrators. The extra permissions include access to grades on fully anonymous assignments, and the ability to delete students with deliveries or feedback from an assignment.
nb: Brukere tilhørende en tillatelsesgruppe for avdelingsadministratorer har adgang til alt, inkludert noe data og handlinger som er utilgjengelige for kursadministratorer. De ekstra tillatelsene inkluderer adgang til karakterer for fullstendige anonymiserte oppgaver, og muligheten for å slette studenter med leveringer eller tilbakemelding på en oppgave.

source: Course administrator
nb: Kursadministrator

source: Course administrator permission groups work just like department permission groups, except that they have a bit fewer permissions (detailed in the "department administrator" section above). Course administrator permission groups are typically only added to one course, or perhaps a couple of courses if the courses share the same course administrators.
nb: Tillatelsesgrupper for kursadministratorer fungerer akkurat som tillatelsesgrupper for avdelinger, unntatt at de har noen færre tillatelser (detaljer vises i seksjonen over "avdelingsadministrator"). Tillatelsesgrupper for kursadministrator er som regel kun lagt til et kurs, eller kanskje to hvis kursene har de samme kursadministratorene.

source: Each course has exactly one special permission group where department and course administrators can add extra administrators.
nb: Hvert kurs har nøyaktig en spesiell tillatelsesgruppe hvor avdelings- og kursadministratorer kan legge til ekstra administratorer.

source: You add admins to this special permission group using the "Add course administrators" button above.
nb: Du legger administratorer til denne spesielle tillatelsesgruppen ved å benytte "Legg til kursadministrator" knappen ovenfor.

source: Semester administrator permission groups is the lowest level of permission for administrators. Semester administrator permission groups are typically only added to one semester, or perhaps a couple of semesters if the they share the same administrators.
nb: Tillatelsesgrupper for semesteradministrator er den laveste grad av tillatelse for administratorer. Tillatelsesgrupper for semesteradministrator er vanligvis bare lagt til for et semester, kanskje to hvis de deler de samme administratorene.
