Repository: KuroiAme/devilry-django
Catalog: devilry/locale/*/LC_MESSAGES/django.po
Languages: nb

source: Post comment
nb: Post kommentar

source: Comment added!
nb: Lagt til kommentar!

# grading
source: Grade
nb: Karakter

# grading
source: Choose grade
nb: Velg karakter

# grading
source: Number between 0 and %(max_points)s.
nb: Tall mellom 0 og %(max_points)s.

source: Save draft and preview
nb: Lagre utkast og forhåndsvis

source: Publish feedback
nb: Publiser tilbakemelding

source: Feedback is already published!
nb: Tilbakemelding er allerede publisert!

source: Give a score between {} to {} where {} is the minimum amount of points needed to pass.
nb: Sett en poengsum mellom {} og {}, hvor {} er minimum antall poeng som kreves for å bestå.

source: Check the box to give a passing grade
nb: Velg denne for å gi bestått karakter

source: Groupcomment
nb: Gruppekommentar

source: Edit comment
nb: Rediger kommentar

source: No changes, comment not updated
nb: Ingen endringer, kommentar ikke oppdatert

source: Comment updated!
nb: Kommentar oppdatert!

source: Add delivery or question
nb: Legg til innlevering eller spørsmål

source: About
nb: Om meg

source: Below you can see information about your profile that is stored in Devilry. Report if the
nb: I tabellen under vises informasjon om din profil som er lagret i Devilry. Rapporter dersom

source: information is wrong
nb: informasjonen er feilaktig

source: Email Address
nb: E-postadresse

source: Reset password
nb: Tilbakestill passord

source: Examiner
nb: Retter

source: Course manager
nb: Kursansvarlig

source: User profile
nb: Brukerprofil

source: Search...
nb: Søk...

source: Get help from the Devilry community.
nb: Få hjelp fra Devilry-fellesskapet.

source: Guides, forum, issue tracker.
nb: Guider, forumer, sakssporer.

source: Documentation provided by your organization.
nb: Dokumentasjon gitt av din organisasjon.

source: Ready for export
nb: Klar for eksportering

source: Most students are ready for export
nb: De fleste studentene er klare for eksportering

source: Not ready for export (retracted)
nb: Ikke klar for eksportering (trukket tilbake)

source: Qualified for final exam status
nb: Kvalifisert til å se status for slutteksamen

source: Qualified for final exam statuses
nb: Kvalifisert til å se status for slutteksamener

source: Back to mainpage
nb: Tilbake til hovedside

source: YES
nb: JA

source: NO
nb: NEI

source: Create new status
nb: Opprett ny status

source: Ready
nb: Klar

source: Not ready
nb: Ikke klar

source: print
nb: skriv ut

source: NOT qualified for final exams
nb: Kan IKKE gå opp til avsluttende eksamen

source: Students on
nb: Studenter i

source: Preview and confirm
nb: Forhåndsvis og bekreft

source: This table shows the result of your choices
nb: Denne tabellen viser resultat av dine valg

source: Ready for export
nb: Klar for eksportering

source: Saved
nb: Lagret

source: by
nb: av

source: Not ready for export
nb: Ikke klar for eksportering

source: students qualify for final exam
nb: studenter kvalifisert for avsluttende eksamen

source: Status retracted reason
nb: Status årsak for tilbaketrekking

source: Retract
nb: Trekk tilbake

source: Status (ready)
nb: Status (klar)

source: Status (not ready)
nb: Stauts (ikke klar)

source: No status has been created for this period yet.
nb: Det er ennå ikke opprettet noen status for denne perioden.

source: Status overview for %(what)s
nb: Status oversikt for %(what)s

source: You can either choose a plugin to create a new status, or you can select a retracted status.
nb: Du kan enten velge en plugin for å lage en ny status, eller du kan velge en tilbaketrukket status.

source: Invalid qualification items was selected.
nb: Ugyldige kvalifiserings-elementer ble valgt.

source: Submit selected %(what)s
nb: Send inn valgte %(what)s

source: Selected %(what)s
nb: Valgte %(what)s

source: No %(what)s selected
nb: Ingen %(what)s valgt

source: How do students qualify for final exams?
nb: Hvordan kvalifiserer studenter til avsluttende eksamen?

source: Select one of the options from the list. Each option starts a wizard that ends with a preview of the results before you get the option to save
nb: Velg et av alternativene fra listen. Hvert alternativ starter som slutter med en forhåndsvisning av resultatene, før du får muligheten til å lagre

source: Provide a message as to why the Status needs to be retracted.
nb: Gi en beskjed om hvorfor Statusen må trekkes tilbake.

source: Message
nb: Beskjed

source: Why is the status retracted?
nb: Hvorfor er denne statusen trukket tilbake?

source: Cannot retract status without a message.
nb: Kan ikke trekke tilbake en status uten en beskjed.

source: Select assignments that must be approved
nb: Velg oppgaver som må godkjennes

source: Choose this option if you require your students to get a passing grade on the assignments you select. All assignments are selected by default.
nb: Velg dette alternativet hvis du krever at dine studenter får bestått på de oppgavene du velger. All oppgaver er valgt som standard.

source: Points to achieve on selected assignments
nb: Poeng som kan oppnås for de valgte oppgavene

source: Choose the total sum of points that needs to be achieved for the selected assignments. All assignments are selected by default.
nb: Velg den totale nødvendige poengsummen som må oppnås for de valgte oppgavene. Alle oppgaver er valgt som standard.

source: If no points are given, the sum of all the qualifying assignments minimum points is needed to qualify.
nb: Hvis det ikke oppgis antall poeng blir summen nødvendig for å kvalifisere seg, summen av minimum poengene for alle kvalifiserende oppgaver.

source: Manually select students
nb: Velg studenter manuelt

source: Manually select the students that qualifies for exam.
nb: Manuelt velg studenter som kvalifiserer for eksamen.

source: Delivery
nb: Innlevering

source: True
nb: Sant

source: False
nb: Usant

# student
source: Your courses
nb: Dine kurs

source: Add delivery
nb: Legg til innlevering

source: The deadline has expired. Since this course is configured with hard deadlines, adding deliveries after the deadline is prohibited.
nb: Innleveringsfristen har utgått. Siden dette kurset har harde frister, er det ikke lov til å legge til innleveringer etter innleveringsfristen.

source: Contact examiner
nb: Kontakt retter

source: The following people are responsible for giving you feedback on this assignment
nb: De følgende personene har ansvar for å gi deg tilbakemelding på denne oppgaven

source: Nobody is registered as responsible for giving you feedback for this assignment at this time.
nb: Hittil er ingen registrert som ansvarlig for å gi deg tilbakemelding på denne innleveringen.

source: Delivery#%(number)s
nb: Innlevering#%(number)s

source: No feedback
nb: Ingen tilbakemelding

source: This delivery has been corrected, and the grade is
nb: Denne oppgaven er rettet, og din karakter er

source: Files
nb: Filer

source: Delivered by
nb: Levert av

source: After the deadline
nb: Etter innleveringsfristen

source: Feedback written by
nb: Tilbakemelding skrevet av

source: Feedback time
nb: Tilbakemeldingstid

source: Deliveries
nb: Innleveringer

source: This assignment is open for deliveries.
nb: Denne oppgaven er åpen for innleveringer.

source: Your assignment is waiting for feedback.
nb: Oppgaven din venter på tilbakemelding.

source: The active deadline has expired, but this assignment is configured with soft deadines so you can still add deliveries.
nb: Den aktive innleveringsfristen har utgått, men denne oppgaven har myke frister så du kan fremdeles legge til innleveringer.

source: This assignment is corrected, and the final grade is:
nb: Denne oppgaven er rettet, og den avsluttende karakteren er:

source: Your assignment has been closed without feedback.
nb: Oppgaven din har blitt lukket uten tilbakemelding.

source: Delete group invite
nb: Slett gruppeinvitasjon

source: Back to project group
nb: Tilbake til prosjektgruppe

source: Are you sure you want to delete the invite for %(user)s?
nb: Er du sikker på at du vil slette invitasjonen til %(user)s?

source: Cancel
nb: Avbryt

source: Delete invite
nb: Slett invitasjon

source: Respond to group invite
nb: Svar på gruppeinvitasjon

source: You have been invited by %(sent_by)s to join their project group for %(subject)s %(assignment)s.
nb: Du har blitt invitert av %(sent_by)s til å bli med i deres prosjektgruppe på %(subject)s %(assignment)s.

source: Decline invitation
nb: Avslå invitasjon

source: Accept invitation
nb: Aksepter invitasjon

source: Project group
nb: Prosjektgruppe

source: You have been invited to join a group!
nb: Du har blitt invitert til en gruppe!

source: %(sent_by)s invited you to join their group.
nb: %(sent_by)s inviterte deg til å bli med i deres gruppe.

source: More info
nb: Mer info

source: Invite someone to join your group?
nb: Inviter noen til å bli med i din gruppe?

source: Waiting for response from
nb: Venter på svar fra

source: Invited by
nb: Invitert av

source: Sent time
nb: Sendt tidspunkt

source: Project group members
nb: Prosjektgruppemedlemmer

source: Assignments
nb: Oppgaver

# student_all_periods
source: Choose a course below to see its assignments
nb: Velg et kurs nedenfor for å se oppgavene på kurset

source: The table below shows all assignments where you can add deliveries. Click the name of an assignment to add a delivery.
nb: Listen nedenfor viser alle oppgaver hvor du kan legge til innleveringer. Klikk på et oppgavenavn for å legge til en innlevering.

# student dashboard
source: Welcome! Please select an assignment below to add deliveries, view feedback or communicate with you examiner.
nb: Velkommen! Vennligst velg en av oppgavene under for å legge til innleveringer, se tilbakemeldinger eller for kommunikasjon med din retter.

source: Upcoming assignments
nb: Kommende oppgaver

source: You have no upcoming assignments with deadlines within the next 7 days.
nb: Du har kommende oppgaver med innleveringsfrist innenfor de neste 7 dagene.

source: Upcoming assignments with deadlines within the next 7 days.
nb: Kommende oppgaver med innleveringsfrist innenfor de neste 7 dagene.

source: Your assignments
nb: Dine oppgaver

# student dashboard
source: Your courses
nb: Dine kurs

source: Waiting for deliveries or for deadline to expire
nb: Venter på innleveringer eller på at innleveringsfristen skal utgå

# student allperiods
source: Your courses
nb: Dine kurs

# student allperiods
source: You are not registered on any courses in Devilry.
nb: Du er ikke registrert i noen kurs i Devilry.

source: Student dashboard
nb: Dashboard for student

# student dashboard
source: You have no active assignments. Use the button below to browse inactive assignments and courses.
nb: Du har ingen aktive oppgaver. Benytt knappen under for å se igjennom inaktive oppgaver og kurs.

source: Send invitation to
nb: Send invitasjon til

source: Select the student you want to invite to your group.
nb: Velg studenten som du vil invitere til din gruppe.

source: Send invitation
nb: Send invitasjon

source: Invite sent to %(student)s.
nb: Invitasjon sent til %(student)s.

source: Joined the group by invitation from %(student)s.
nb: Ble med i gruppen etter invitasjon fra %(student)s.

source: Declined group invitation from %(student)s.
nb: Avslå gruppeinvitasjon fra %(student)s.

source: You are already part of a group with more than one student!
nb: Du er allerede en del av gruppe med mer enn 1 student!

source: You have already accepted this invite
nb: Du har allerede akseptert denne invitasjonen

source: You have already declined this invite
nb: Du har allerede avvist denne invitasjonen

source: Removed project group invitation %(student)s.
nb: Fjernet invitasjon til prosjektgruppe %(student)s.

# student period overview
source: No assignments.
nb: Ingen oppgaver.

source: This assignment uses hard deadlines. You will not be able to write comments or upload files after the deadline has expired.
nb: Denne oppgaven bruker harde frister. Du vil ikke kunne skrive kommentarer eller laste opp innleveringer etter fristen.

source: This assignment uses hard deadlines. Students will not be able to write comments or upload files after the deadline has expired.
nb: Denne oppdaven bruker harde frister. Studenter vil ikke kunne skrive kommentarer eller laste opp innleveringer etter fristen.

source: English
nb: Engelsk

source: Norwegian Bokmal
nb: Norsk bokmål
