Repository: KuroiAme/devilry-django
Catalog: devilry/locale/*/LC_MESSAGES/django.po
Languages: nb

source: New deadline is %(feedbackset_deadline)s
nb: Ny innleveringsfrist er %(feedbackset_deadline)s

# devilry deadline moved
source: See the delivery feed for more details
nb: Se leveringsoversikten for flere detaljer

source: You have been given a new attempt in %(assignment_name)s with deadline %(feedbackset_deadline)s
nb: Du har fått et nytt forsøk på %(assignment_name)s med tidsfrist %(feedbackset_deadline)s

# devilry email feedback
source: Result
nb: Resultat

# devilry email feedback
source: Corrected datetime
nb: Tidspunkt for korrigering

# devilry email feedback
source: Deadline datetime
nb: Tidspunkt for innleveringsfrist

# devilry email feedback
source: Assignment
nb: Oppgave

# devilry email feedback
source: Subject
nb: Kurs

# devilry email feedback
source: See the delivery feed for more details
nb: Se leveringsoversikten for flere detaljer

# breadcrumb
source: Examiner
nb: Retter

source: Bulk feedback
nb: Bulk tilbakemelding

source: Simple bulk feedback
nb: Enkel bulk-håndtering av tilbakemelding

source: You have no students waiting for feedback.
nb: Du har ingen studenter som venter på tilbakemelding.

source: You are currently not expecting new deliveries from any students.
nb: For øyeblikket forventer du ikke nye leveringer fra noen studenter.

source: You have not finished correcting any students yet.
nb: Du er ennå ikke ferdig med å korrigere noen studenter.

source: Passed
nb: Bestått

source: Failed
nb: Ikke bestått

source: Here you can set a grade for each group and add a comment that will be created when the feedback is published. <br> Note that no feedback will be published for groups without a grade set. Comment text is optional.
nb: Her kan du sette en karakter for hver gruppe og legge til en kommentar som blir laget når tilbakemeldingen er publisert.<br>Legg merke til at ingen tilbakemeldinger blir publisert for grupper uten et karaktersett. Kommentarer er valgfritt.

source: Minimum points to pass
nb: Minimum antall poeng for å bestå

source: Publish feedbacks
nb: Publiser tilbakemeldinger

source: When submitted, the operation cannot be undone.
nb: Handlingen kan ikke omgjøres når den er innsendt.

source: Short comment
nb: Kort kommentar

source: Listing of assigments where you are set as examiner.
nb: Utlisting av oppgaver hvor du er satt som retter.

source: {0} delivery received
nb: {0} innlevering mottatt

source: {0} deliveries received
nb: {0} innleveringer mottatt

source: Write feedback
nb: Gi tilbakemelding

source: Show feedback
nb: Vis tilbakemelding

# grading
source: Passed?
nb: Bestått?

# grading
source: Check to provide a passing grade.
nb: Huk av for å gi en bestått karakter.

source: Bulk create feedback
nb: Opprett tilbakemelding i bulk

source: Bulk added feedback for %(group_names)s
nb: Tilbakemelding lagt til med bulk for %(group_names)s

source: Students in groups
nb: Studenter i grupper

source: Grading
nb: Karaktersetting

source: Comment text
nb: Kommentar tekst

source: Feedback published for {} groups
nb: Tilbakemelding publisert for {} grupper

source: You must set a grade for at least one group.
nb: Du m sette en karakter for minst en gruppe.

source: No groups to receive feedback
nb: Ingen grupper som kan motta tilbakemelding

# selected_assignment_group_form error_message
source: Invalid assignment group items was selected.
nb: Ugyldige elementer fra oppgavegruppene ble valgt.

source: Delivery has been corrected.
nb: Denne oppgaven er korrigert.

source: assignment group
nb: oppgavegruppe

# assignment_group_target_renderer submit_button_text
source: Submit selected %(what)s
nb: Send inn valgte %(what)s

source: %(waiting_for_feedback_count)s waiting for feedback
nb: %(waiting_for_feedback_count)s venter på tilbakemelding

source: Nobody waiting for feedback
nb: Ingen venter på tilbakemelding

# examiner assignmentlist
source: Examiner dashboard
nb: Retter dashboard

# roleselect
source: Upload deliveries or see your delivery and feedback history.
nb: Laste opp innleveringer eller se dine innleveringer og tilbakemeldingshistorie.

# role
source: Examiner
nb: Retter

# roleselect
source: Give students feedback on their deliveries as examiner.
nb: Gi studenter tilbakemelding på deres leveringer som retter.

# roleselect
source: Manage departments, courses, semesters and assignments.
nb: Administrer avdelinger, kurs, semestre og oppgaver.

source: Devilry frontpage
nb: Devilry forside

source: Choose your role
nb: Velg din rolle

source: You do not have access to anything in Devilry.
nb: Du har ikke adgang til noe i Devilry.

source: Click here to learn how to get access to Devilry
nb: Klikk her for å lære hvordan man får adgang til Devilry

source: I should have had more roles
nb: Jeg burde hatt flere roller

source: Superuser UI
nb: Superbruker UI

source: Add comment
nb: Legg til kommentar

source: Previous
nb: Forrige

source: Grading system
nb: Karaktersystem

source: Step %(number)s/%(total)s
nb: Steg %(number)s/%(total)s

source: %(percent)s%% Complete
nb: %(percent)s%% Ferdig

source: Finish
nb: Ferdig

source: Reconfigure the grading system
nb: Rekonfigurer karaktersystemet

source: Reconfigure
nb: Rekonfigurere

source: How are results presented to the student?
nb: Hvordan skal resultatet presenteres for studenten?

source: As passed or failed
nb: Som bestått eller ikke bestått

source: Students see their result as passed or failed.
nb: Studentene ser resultatet som bestått ikke bestått.

source: You select the number of points required to pass in the next step of this wizard.
nb: Du bestemmer antall poeng nødvendig for å bestå i neste steg.

source: As points
nb: Som poeng

source: Students see their result as points/max-points, and they can see if the number of points is a passing or a failing grade.
nb: Studentene ser resultat som antall oppnådde poeng, og om oppnådd poengsum er nok til å bestå.

source: As a text looked up in a custom table
nb: Som en tekst sett i en egendefinert tabell

source: You set up a table mapping points to a grade. Use this if you want to grade your students according to some scale, such as A-F.
nb: Du setter opp en tabell som definerer koblingen mellom poeng og karakter. Bruk denne om du ønsker å sette karakter fra en skala som for eksempel A til F.

source: How would you like to provide feedback to your students?
nb: Hvordan vil du gi tilbakemelding til studentene?

source: Warning
nb: Advarsel

source: This selection can not be reverted. You will have to re-run this wizard later to change your selection.
nb: Dette valget kan ikke reverseres. Du må gjenta konfigureringsprosessen om igjen for å endre.

source: Please select how you provide feedback to your students from the list below. Your selection starts a wizard that you have to complete before any deliveries can be corrected on this assignment.
nb: Velg hvordan du vil gi tilbakemelding til studentene fra listen nedenfor. Du må fortsette stegene videre i konfigurasjonen som må gjøres komplett før noen oppgaver kan bli rettet på denne oppgaven.

source: Use this
nb: Bruk dette

source: If none of the choices for configuring the grading system fit your needs, please go back to the previous page, and read about plugins.
nb: Dersom ingen av valgene for konfigurasjon faller i smak, gå tilbake og les om retteplugins.

source: Set the maximum possible number of points
nb: Definer maksimalt antall poeng

source: The result of grading with the selected grading system, &ldquo;%(plugintitle)s&rdquo;, is a number between zero and a value you have to configure. Please configure the maximum possible number of points.
nb: Resultatet av karaktersetting med det valgte oppsettet, &ldquo;%(plugintitle)s&rdquo;, er et nummer mellom 0 og en verdi du selv definerer. Definer det maksimale antall poeng.

source: Select the grade required to pass
nb: Velg karakteren nødvendig for å bestå

source: Set the minumum number of points required to pass
nb: Definer minimum antall poeng nødvendig for å bestå

source: Map points to grade
nb: Link poeng til karakter

source: Setup how you wish to map points to grade. Specify the grade in the first column, and the minimum number of points required to get that grade in the second column. The first row must have the value 0 in the second column.
nb: Definer hvordan du ønsker å linke poeng til karakter. Spesifiser karakteren i den første kolonnen og den minimale poengsum for å oppnå karakteren i den andre kolonnen. Den første raden må ha verdien 0 i den andre kolonnen.

source: Add more rows
nb: Legg til flere rader

source: Example
nb: Eksempel

source: Devilry has a plugin architecture for grading systems. This makes it easy to handle vastly diverging methods of providing feedback to students.
nb: Devilry inkluderer en plugin-arkitektur for karaktersetting. Dette gjør det enkelt å håndtere alle ulike måter å definere karakterer på.

source: No grading system configured. This can happen if this assignment was created using Devilry 1.3.6 or older.
nb: Det er ikke konfigurert noe karaktersystem. Årsåken kan være at oppgaven var opprettet i Devilry versjon 1.3.6 eller eldre.

source: The grading system is not configured correctly. This can happen if you or another admin has started reconfiguring the grading system, and did no complete the wizard.
nb: Karaktersystemet er ikke konfigurert korrekt. Årsaken kan være at en annen med administratortilgang har startet rekonfigurering av karaktersystemet uten å fullføre.

source: Before you can provide feedback to your students, you have to reconfigure the grading system for this assignment.
nb: Før du kan gi tilbakemeldinger til studentene, må du rekonfigurer karaktersystemet for denne oppgaven.

source: Current configuration
nb: Gjeldende konfigurasjon

source: How do you provide feedback to your students?
nb: Hvordan vil du gi tilbakemelding til studentene?

source: Maximum possible number of points
nb: Maksimalt antall poeng

source: Minumum number of points required to pass
nb: Minimum antall poeng nødvendig for å bestå

source: You SHOULD NOT reconfigure the grading system for this assignment. A least one student has already been given feedback. If you reconfigure the grading system, you should consider providing new feedback to all students.
nb: Du BØR IKKE rekonfigurere karaktersystemet på denne oppgaven. Minst en student har allerede blitt gitt tilbakemelding. Dersom du går videre bør du vurdere å gi nye tilbakemeldinger til alle studenter.

source: You can reconfigure the grading system for this assignment, but be careful, at least one examiner has saved a feedback draft.
nb: Du kan rekonfigurere karaktersystemet for denne oppgaven, men vær obs på at minst en retter har lagret et utkast til tilbakemelding.

source: This means that no students have received feedback yet, but at at least one examiner has started giving feedback.
nb: Dette betyr at ingen har mottatt tilbakemelding, men minst en retter har startet retteprosessen.

source: You can safely reconfigure the grading system for this assignment.
nb: Du kan trygt endre konfigurasjonen av karaktersystemet for denne oppgaven.

source: No students have been given feedback yet, and no examiner has saved any feedback drafts.
nb: Ingen studenter har mottatt tilbakemelding og ingen retter har lagret noe utkast til tilbakemelding.

source: Plugins and why you may care about them
nb: Plugins og hvorfor du kanskje vil lære mer

source: The system for grading students and providing feedback is very flexible in Devilry. Common for all methods of grading (passed/failed, points, A-F, ...) is that the end result is the following information:
nb: Systemet for karaktersetting og mulighetene rundt tilbakemeldinger er meget fleksibelt i Devilry. Felles for alle metoder er at sluttresultatet består av følgende:

source: Points
nb: Poeng

source: Any grade in Devilry is represented as a number. This number is used for statistics and to calculate final grades. Points is not available directly to students, but some grading system plugins make them available through the "Short text" (below).
nb: Enhver karakter i Devilry er representert med et nummer. Nummeret brukes i statistikk og for automatisk kalkulering av karakterer. Poeng er ikke direkte tilgjengelig for studentene men enkelte karaktersystemer velger å gjøre det synlig gjennom "Korttekst" (nedenfor)

source: Short text
nb: Korttekst

source: A very short text that students view. Usually something like: "Approved", "B" or "7/10".
nb: En veldig kort tekst ment til å gi en beskrivelse for studentene. For eksempel: "Godkjent", "B" eller "7/10".

source: Long text
nb: Lang tekst

source: A longer text that students can view. This is usually the detailed feedback text, however some grading system plugins also fill this with autogenerated information based on input from examiners. What a grading system plugin can display in the long text is virtually unlimited.
nb: En mer utfyllende tekstene studentene kan se. Dette er vanligvis den detaljerte tilbakemeldingen. Dette feltet autogeneres av enkelte plugins basert på informasjon fra retterne. Her er mulighetene mange.

source: Your examiners/correctors may provide this information in many ways; by specifying a numeric value, by selecting approved, by answering a set of questions, and so on. Each of these different ways of providing feedback is a plugin to the grading system in Devilry.
nb: Dine rettere kan gi denne informasjonen videre på mange forskjellige måter: Ved å spesifisere en numerisk verdi, ved å velge godkjent, ved å besvare et sett spørsmål og mer til. Hver av disse måtene virkeliggjøres gjennom et plugin til Devilry.

source: If none of the plugins shown in the first page of the <em>Reconfigure the grading system</em> wizard fit your needs, please contact your local devilry system administrators, or contact the developers of the Devilry open source project directly at %(websitelink)s.
nb: Dersom ingen plugins listet opp på førstesiden av <em>Rekonfigurer karaktersystemet</em> møter dine behov, ta kontakt din lokale Devilry systemadministrator, eller med utviklerne av åpen-kildekodeprosjektet Devilry direkte på %(websitelink)s.

source: Preview
nb: Forhåndsvisning

source: Publish
nb: Publiser

source: without preview
nb: uten forhåndsvisning

source: Save draft
nb: Lagre utkast

source: Save and continue editing
nb: Lagre og fortsett redigering

source: Edit feedback
nb: Rediger tilbakemelding

source: Edit feedback for
nb: Rediger tilbakemelding for

source: Preview feedback
nb: Forhåndsvis tilbakemelding

source: Edit draft
nb: Endre utkast

source: Heading 1
nb: Overskrift 1

source: Heading 2
nb: Overskrift 2

source: Heading 3
nb: Overskrift 3

source: Insert link
nb: Sett inn link

source: Unordered list
nb: Uordned liste

source: Ordered list
nb: Ordna liste

source: Blockquote
nb: Sitat

source: Programming code
nb: Programmeringskode

source: LaTeX mathematics
nb: LaTeX matematikk

source: Help
nb: Hjelp

source: Programming language
nb: Programmeringsspråk

source: Uploaded file
nb: Opplastet fil

source: Remove file
nb: Fjern fil

source: Configure
nb: Konfigurer

source: Select how results are presented to the students
nb: Velg hvordan resultatene skal presenteres

source: Select the grade required to pass the assignment
nb: Velg karakteren som er nødvendig for å bestå oppgaven

source: One or more of the selected groups has no deliveries.
nb: En eller flere av de valgte gruppene har ingen innleveringer.

source: Feedback text
nb: Tilbakemeldingstekst

source: Loaded draft saved %(save_datetime)s by %(user)s.
nb: Lastet kladd lagret %(save_datetime)s av %(user)s.

source: Feedback text (optional)
nb: Tilbakemeldingstekst (ikke påkrevd)

source: Attach a file file to your feedback (optional)
nb: Last opp et vedlegg til din tilbakemelding (ikke påkrevd)

source: Passed/failed
nb: Bestått/ikke bestått

source: Provides a single checkbox that can be checked to provide a passing grade.
nb: Viser en boks som kan klikkes for å gi bestått karakter.

source: Passed?
nb: Bestått?

source: Check to provide a passing grade.
nb: Velg denne for å gi bestått karakter.

source: Choose a number between zero and a maximum that you specify on the next page.
nb: Velg et tall mellom null og en maksverdi som du spesifiserer på neste side.

source: Number between 0 and {max_points}.
nb: Tall mellom 0 og {max_points}.

source: A student comment is always visible to everyone
nb: En kommentar fra en student er alltid synlig for alle

source: A examiner comment can only be private if part of grading.
nb: En kommentar fra en retter kan kun være privat hvis den tilhører karaktersetting.

source: first attempt
nb: første forsøk

source: new attempt
nb: nytt forsøk

source: re edit
nb: re-rediger

source: merge first attempt
nb: flett første forsøk

source: merge new attempt
nb: flett nytt forsøk

source: merge re edit
nb: flett re-rediger

source: FeedbackSet can not be ignored without a reason
nb: Tilbakemeldingssett kan ikke ignoreres uten en årsak

source: FeedbackSet can not have a ignored reason without being set to ignored.
nb: Tilbakemeldingssett må være innstilt til ignorer når en årsak for ignorering blir oppgitt.

source: Ignored FeedbackSet can not have grading_published_datetime, grading_points or grading_published_by set.
nb: Ignorer Tilbakemeldingssett kan ikke ha grading_published_datetime, grading_points eller grading_published_by set.

source: A FeedbackSet can not be published without being published by someone.
nb: Et sett av tilbakemeldinger må publiseres av noen før det kan publiseres.

source: A FeedbackSet can not be published without providing "points".
nb: Et sett av tilbakemeldinger can ikke publiseres uten å sette "poeng".

source: This assignment is on an inactive semester. File upload and commenting is disabled.
nb: Denne oppgaven er på et inaktivt semester. Filopplasting og kommentering er ikke tilgjengelig.

source: Hard deadlines are enabled for this assignment. File upload and commenting is disabled.
nb: Denne oppgaven bruker harde frister. Filopplasting og kommentering er ikke tilgjengelig.

source: Project group details
nb: Detaljer om prosjektgruppe

source: Discuss
nb: Diskuter

source: Internal notes
nb: Interne notater

source: active
nb: aktiv

# devilry_group feedbackfeed examiner
source: Feedback
nb: Tilbakemelding

source: Back to feed
nb: Tilbake til feed

source: Edit grade
nb: Rediger karakter

source: Current result
nb: Nåværende resultat

# devilry comment history
source: Comment history
nb: Kommentarhistorikk

source: No comment-history available. This may be because you do not have access to see the edit-history for this comment. If you think this is an error, please contact an administrator.
nb: Ingen kommentarhistorikk tilgjengelig. Dette kan være fordi du ikke har tilgang til å se historikken for denne kommentaren. Hvis du tror dette er en feil, vennligst kontakt en administrator.

source: Internal notes for this student or project group.
nb: Interne notater for denne studenten eller prosjektgruppen.

source: Visible only to examiners and admins. Notes are not visible to students.
nb: Kun synlig for rettere og administratorer. Notater er ikke synlig for studenter.

source: Discuss with the student(s).
nb: Diskuter med student(er).

source: Anything you write or upload here is visible to the student(s), examiners, and admins.
nb: Alt du skriver eller laster opp her er synlig for studenten(e), rettere og administratorer.

source: Download
nb: Last ned

source: Actions
nb: Valg

source: File uploads and comments disabled
nb: Filopplasting og kommentering er ikke tilgjengelig

source: Edit last delivery
nb: Rediger siste innlevering

source: Visible only to you, your co-examiners (if any) and admins. Students can not see these notes.
nb: Kun synlig for deg, dine co-rettere(hvis noen) og administratorer. Studenter kan ikke se disse notatene.

source: Anything you write or upload here is visible to the student(s), co-examiners (if any), and admins, but it is not considered part of your feedback/grading.
nb: Alt du skriver eller last opp her er synlig for studenten(e), andre rettere (hvis eksisterer) og administratorer, men innholdet er ikke ansett som en del av din tilbakemelding/karaktersetting.

source: Upload a file by dragging and dropping it here
nb: Last opp en fil ved å dra og slippe den her

source: Upload files by dragging and dropping them here
nb: Last opp filer ved å dra og slippe de her

source: Invalid filetype
nb: Ugyldig filtype

source: ... or select a file
nb: ... eller velg en fil

source: ... or select files
nb: ... eller velg filer

source: Select a file ...
nb: Velg en fil ...

source: Select files ...
nb: Velg filer ...

source: Delete
nb: Slett

source: Your delivery must be uploaded as one or more files or typed into the box below.
nb: Din levering må bli lastet opp som en eller flere filer, eller skrevet inn i boksen nedenfor.

source: You can also ask questions to your examiner(s). All uploaded files and comments for one deadline is considered a part of your delivery, so if you add a comment that makes a previous comment obsolete, you should say so.
nb: Du kan også stille spørsmål til din(e) retter(e). Alle opplastede filer og kommentarer for en innleveringsfrist er ansett som en del av din levering. Hvis du legger til en kommentar for å gjøre forrige kommentar utdatert, bør du si ifra om dette.

# devilry_group feedbackfeed edit groupcomment
source: Edit
nb: Rediger

# devilry_group feedbackfeed
source: only visible to examiners and admins
nb: kun synlig for rettere or studenter

# groupcomment last edited link
source: Last edited
nb: Sist redigert

# devilry_group feedbackfeed
source: Deadline expired
nb: Innleveringsfristen har utgått

# deadline_move
source: Deadline moved from
nb: Innleveringsfrist flyttet fra

# deadline_move
source: to
nb: til

# deadline_move
source: by
nb: av

# devilry_group feedbackfeed delete groupcomment
source: Delete
nb: Slett

# devilry_group feedbackfeed
source: not published
nb: ikke publisert

# devilry_group feedbackfeed part of feedback badge
source: feedback
nb: tilbakemelding

source: Attempt
nb: Forsøk

source: Merged
nb: Sammenslått

# devilry_group feedbackfeed
source: This delivery was corrected, and given
nb: Denne oppgaven er rettet, og din karakter er

# devilry_group feedbackfeed grading updated by
source: by
nb: av

# devilry_group feedbackfeed grading updated from
source: The grade was changed from
nb: Rettingen ble endret fra

# devilry_group feedbackfeed grading updated to
source: to
nb: til

# devilry_group feedbackfeed
source: Not part of delivery
nb: Ikke en del av leveringen

source: after deadline
nb: etter innleveringsfristen

source: %(verbose_feedbackset)s deadline
nb: %(verbose_feedbackset)s tidsfrist

source: Submitted after deadline
nb: Sendt inn etter innleveringsfristen

source: Submitted by examiner
nb: Sent inn av retter

source: USER DELETED
nb: BRUKER SLETTET

source: first
nb: første

source: second
nb: andre

source: third
nb: tredje

source: fourth
nb: fjerde

source: fifth
nb: femte

source: sixth
nb: sjette

source: seventh
nb: syvende

source: eighth
nb: åttende

source: ninth
nb: niende

source: tenth
nb: tiende

source: Add note
nb: Legg til notat

# comment edit history item
source: Only visible to you
nb: Kun synlig for deg

# comment edit history item
source: Only visible to examiners and admins
nb: Kun synlig for rettere og administratorer

# comment edit history item
source: Visible to everyone
nb: Synlig for alle

source: Comment edit history
nb: Historikk for kommentarredigering

source: No items
nb: Ingen elementer

source: A comment must have either text or a file attached, or both. An empty comment is not allowed.
nb: En kommentar må enten innehold tekst, vedlegg eller begge. Tomme kommentarer er ikke tillatt.
