Repository: KuroiAme/devilry-django
Catalog: devilry/locale/*/LC_MESSAGES/django.po
Languages: nb

source: Users in a semester administrator permission group do not have access to anonymous assignments. The primary use case for semester administrators is for teaching assistents and other administrators that should only have access to normal non-anonymous assignments.
nb: Brukere tilhørende en tillatelsesgruppe for semesteradministratorer har ikke adgang til anonyme oppgaver. Det primære bruksmønsteret for semesteradministratorer er lærer-assistenter og andre administratorer som kun skal ha adgang til normale, ikke anonymiserte oppgaver.

source: Each semester has exactly one special permission group where department, course and semester administrators can add extra administrators.
nb: Hvert semester har nøyaktig en spesiell tillatelsesgruppe hvor avdelings-, kurs- og semesteradministratorer kan legge til ekstra administratorer.

source: You add users to this special permission group using the "Add semester administrators" button above.
nb: Du legger administratorer til denne spesielle tillatelsesgruppen ved å benytte "Legg til semesteradministrator" knappen ovenfor.

source: A user is always given the highest level of permission available. This means that if a user is both in a department administrator permission group and a course administrator permission group for a course, they will have department administrator permissions for that course.
nb: En bruker blir alltid gitt høyest mulig tillatelse. Dette betyr at hvis en bruker er både i en gruppe for avdelingsadministratorer og i en gruppe for kursadministratorer for et kurset, blir de gitt tillatelsene tilhørende gruppen for avdelingsadministratorer.

source: Create new course
nb: Opprett nytt kurs

source: Find a student
nb: Finn en student

source: Click the button below to search for a student and find all their assignments. When you find an assignment, you can move their deadlines, communicate with the student, and view details about their deliveries and feedback.
nb: Klikk på knappen under for å finne en student og alle oppgavene til studenten. Når du finner en oppgave kan du flytte innleveringsfristen, kommunisere med studenten og se detaljer om innleveringer og tilbakemeldinger.

# devilry admin studentfeedbackfeed wizard
source: Deadline
nb: Innleveringsfrist

# devilry admin studentfeedbackfeed wizard
source: Inactive
nb: Inaktiv

# devilry admin studentfeedbackfeed wizard
source: Subject
nb: Kurs

source: Here you can search, filter etc. to find an assignment for a student. Click on the assignment for details about it.
nb: Her kan du søke, filtrere osv. for å finne en oppgave for en student. Klikk på oppgaven for å se detaljer.

# devilry admin student feedbackfeed wizard
source: Filter semesters and subjects
nb: Filtrer semester og kurs

source: by using the search field, you can easily find subjects and semesters by both their short name and long name.
nb: ved å bruke søkefeltet, du kan kan på denne måten finne kurs og semestre.

# devilry admin student feedbackfeed wizard
source: Filter examiners
nb: Filtrer rettere

source: by using the search field. You can search for examiners by both their short names and full names. This makes it possible to filter the assignments by examiners related to the selected student.
nb: ved å bruke søkefeltet. Du kan søke på rettere via både brukernavn og fullt navn. Dette gjør det mulig å filtrere oppgaver for en student basert på rettere.

source: Please select a student. Use the search box to find the student. You can search by both full name and username/email.
nb: Vennligst velg en student. Bruk søkefeltet for å finne studenten. Du kan både søke på fullt navn og brukernavn/e-post.

source: No examiner(s)
nb: Ingen retter(e)

source: No students
nb: Ingen studenter

source: %(studentcount)s students in %(groupcount)s project group
nb: %(studentcount)s studenter i %(groupcount)s prosjektgruppe

source: Select the admins you want to add to %(period)s
nb: Velg administratorer som du vil legge til for %(period)s

source: Back to admins on semester overview
nb: Tilbake til oversikt av semesteradministratorer

source: Remove %(user)s
nb: Fjern %(user)s

source: Remove
nb: Fjern

source: Administrators for %(period)s
nb: Administratorere for %(period)s

source: Back to semester overview
nb: Tilbake til oversikt for semester

source: Add semester administrators
nb: Legg til semesteradministratorere

source: Other administrators with access to %(period)s
nb: Andre administratorer med adgang til %(period)s

source: No other administrators than the ones listed above have access.
nb: Kun administratorene som listes ut ovenfor har adgang.

source: No manually added semester administrators for this semester. You can add administrators using the button above.
nb: Ingen semesteradministratorer er manuelt lagt til for dette semesteret. Du kan legge til administratorer ved å bruke knappen ovenfor.

source: Not registered
nb: Ikke registrert

source: Waiting for deliveries
nb: Venter på innleveringer

source: No deliveries
nb: Ingen innleveringer

source: Waiting for feedback
nb: Venter på tilbakemelding

source: Tips and help
nb: Tips og hjelp

source: If the name of your assignment ends with a number, Devilry will automatically suggest the name for the next assignment.
nb: Hvis navnet på oppgaven slutter med et tall, vil Devilry automatisk foreslå navnet til neste oppgave.

source: The short name is used in places where the full name takes up too much space.
nb: Det korte navnet benyttes steder hvor det fulle navnet tar for mye plass.

source: %(assignment)s created successfully, but no students where added. Only active students on the semester can be added to the assignment.
nb: %(assignment)s opprettet, men ingen studenter ble lagt til. Kun aktive studenter på semesteret kan bli lagt til på oppgaven.

# devilry admin periodadmin
source: Add/manage students on
nb: Legg til/administrer studenter på

source: %(assignment)s created successfully. All active students on the semester have been added to the assignment.
nb: %(assignment)s opprettet. Alle aktive studenter på semesteret er lagt til på oppgaven.

# devilry admin periodadmin
source: Add/remove or view students
nb: Legg til/fjern eller se studenter

source: Select a suggested deadline
nb: Velg en foreslått innleveringsfrist

source: Select the examiners you want to add to %(period)s
nb: Velg rettere du vil legge til for %(period)s

source: Back to examiners on semester overview
nb: Tilbake til semesteroversikt for retter

source: Mark %(user)s as inactive
nb: Marker %(user)s som inaktive

source: Mark as inactive
nb: Marker som inaktiv

source: Inactive examiner - has no access to any assignments within the semester.
nb: Inaktiv retter - har ikke tilgang til noen oppgaver for inneværende semester.

source: Re-activate %(user)s
nb: Reaktiver %(user)s

source: Re-activate
nb: Reaktiver

source: Examiners on %(period)s
nb: Rettere i %(period)s

source: Import examiners
nb: Importer rettere

source: You have no examiners. Use the buttons above to add examiners.
nb: Du har ingen rettere. Bruk knappen nedenfor for å legge til rettere.

source: Back to manage tags overview
nb: Tilbake til oversikt for håndtering av tags

source: Add tags to the semester
nb: Legg tags til semesteret

source: Existing tags
nb: Eksisterende tags

source: Back to period tags overview
nb: Tilbake til oversikt for periodens tags

source: Add tag
nb: Legg til tag

source: How would you like to bulk-manage tags for %(relateduser_type)ss?
nb: Hvordan vil du bulk-håndtere tags for %(relateduser_type)s?

source: Add tags
nb: Legg til tags

source: Select %(relateduser_type)s(s) and add tags
nb: Velg %(relateduser_type)s og legg til tags

source: Replace tag
nb: Erstatt tag

source: Select %(relateduser_type)s(s) and replace tag
nb: Velg %(relateduser_type)s og erstatt tag

source: Remove tag
nb: Fjern tag

source: Select %(relateduser_type)s(s) and remove tags
nb: Velg %(relateduser_type)s og fjern tags

source: Show
nb: Vis

source: Hide
nb: Skjul

source: Remove examiners
nb: Fjern rettere

source: Hidden tag - not visible anywhere except in this list.
nb: Skjult tag - ikke synlig noe annet sted enn i denne listen.

source: Edit
nb: Rediger

source: Create new assignment
nb: Opprett ny oppgave

source: Students and examiners
nb: Studenter og rettere

source: %(num_students)s student(s) and %(num_examiners)s examiner(s) on the semester
nb: %(num_students)s studenter og %(num_examiners)s rettere på semesteret

source: Only students registered for this semester can be added to assignments within the semester.
nb: Kun studenter registrert for dette semesteret kan legges til oppgaver innenfor semesteret.

source: Add/edit students
nb: Legg til/rediger studenter

source: Add/edit examiners
nb: Legg til/rediger rettere

source: Semester tags
nb: Tags for semester

source: Create semester tags that can be used as filtering options later on. These tags will be available as filters when e.g organizing examiners and students when configuring an assignment.
nb: Lag semester tagger som kan bli brukt som filtreringsvalg senere. Disse taggene vil være tilgjengelige når man f.eks organiserer rettere og studenter under konfigurering av oppgaver.

source: Semester administrators
nb: Semesteradministratorer

source: You can add semester administrators. Semester administrators have mostly the same permissions as course administrators except that they do not have access to anonymous assignments.
nb: Du kan legge til semesteradministratorer. Semesteradministratorer har stort sett de samme tillatelsene som kursadministratorer, med unntak av tilgang til anonyme oppgaver.

source: Add/edit semester administrators
nb: Legg til/rediger semesteradministratorere

source: Utilities
nb: Verktøy

source: Overview of all results
nb: Oversikt av alle resultater

source: Qualified for final exams
nb: Kvalifisert til avsluttende eksamen

source: Select the students you want to add to %(period)s
nb: Velg studentene du vil legge til for %(period)s

source: Back to students on semester overview
nb: Tilbake til oversikt av studenter i semesteret

source: Inactive student - can not be added to new assignments, and can not be marked as qualified for final exams.
nb: Inaktiv student - kan ikke bli tildelt nye oppgaver, ei heller bli markert som kvalifisert for avsluttende eksamener.

source: Students on %(period)s
nb: Studenter i %(period)s

source: Import students
nb: Importer studenter

source: You have no students. Use the buttons above to add students.
nb: Du har ingen studenter. Bruk knappen nedenfor for å legge til studenter.

source: Could not find any students matching your search.
nb: Fant ingen studenter som samsvarer med ditt søk.

source: Import users
nb: Importer brukere

source: Select the admins you want to add to %(subject)s
nb: Velg administratorer som du vil legge til for %(subject)s

source: Back to admins on course overview
nb: Tilbake til oversikt av kursadministratorer

source: Administrators for %(subject)s
nb: Administratorere for %(subject)s

source: Back to course overview
nb: Tilbake til kursoversikt

source: Add course administrators
nb: Legg til kursadministrator

source: Other administrators with access to %(subject)s
nb: Andre administratorer med adgang til %(subject)s

source: No manually added course administrators for this course. You can add administrators using the button above.
nb: Ingen kursadministratorer er manuelt lagt til for dette kurset. Du kan legge til administratorer ved å bruke knappen ovenfor.

source: Back to dashboard overview
nb: Tilbake til dashordoversikt

source: Create new semester
nb: Opprett nytt semester

source: Course administrators
nb: Kursadministratorer

source: Course administrators have access to do everything within their courses, except delete deliveries from students and published feedback.
nb: Kursadministratorer har adgang til å gjøre alt innen for sine kurs, unntatt å slette leveringer fra studenter og publiserte tilbakemeldinger.

source: Add/edit course administrators
nb: Legg til/rediger kursadministratorere

# assignment config
source: Edit anonymization settings
nb: Redigere innstillinger for anonymisering

# assignment config
source: Changed anonymization mode from "%(old_anonymizationmode)s" to "%(new_anonymizationmode)s".
nb: Endre modus for anonymisering fra "%(old_anonymizationmode)s" til "%(new_anonymizationmode)s".

# deadline handling update hard choice
source: SOFT. Students will be able to add upload deliveries and comment after the deadline has expired, but this will be clearly highlighted. Deliveries made after the deadline has expired might not be considered when an examiner is correcting deliveries.
nb: MYK. Student kan laste opp innleveringer og kommentere etter fristen, men dette vil være tydelig markert. Innleveringer gjort etter fristen vil ikke nødvendigvis bli tatt i betraktning når oppgavene rettes.

# deadline handling update hard choice
source: HARD. Students will not be able to upload deliveries or comment after the deadline has expired. This can only be reverted by setting the deadline handling to soft, extending the deadline or give a new attempt. A highlighted box will appear in the top of the delivery feed informing the user that the assignment uses hard deadlines.
nb: HARD. Studenter kan ikke laste opp innleveringer eller kommentere etter fristen. For at studenter skal kunne laste opp og kommentere igjen må enten oppgavens håndtering av frister settes til MYK, fristen utvides eller studentene gis nye forsøk. En markert boks vil dukke opp øverst i innleverings feeden som informerer om at oppgaven bruker harde frister.

# assignment config
source: Edit deadline handling
nb: Rediget håndtering av innleveringsfrister

# deadline update view deadline soft text
source: SOFT
nb: MYK

# assignment config
source: Changed deadline handling from "%(old_deadline_handling_text)s" to "%(new_deadline_handling_text)s".
nb: Endret håndtering av innleveringsfrist fra "%(old_deadline_handling_text)s" til "%(new_deadline_handling_text)s".

source: All students registered on this assignment has already been added to this examiner.
nb: Alle studenter som er registrert til denne oppgaven er allerede lagt til denne retteren.

source: Added %(count)s students.
nb: La til %(count)s studenter.

source: Added %(groupcount)s project group with %(studentcount)s students.
nb: La til %(groupcount)s prosjektgruppe med %(studentcount)s studenter.

source: Organize examiners on tags
nb: Organiser rettere etter tags

source: You must select at least two examiners.
nb: Du må velge minst to rettere.

source: Select at least two examiners:
nb: Velg minimum to rettere:

source: Select at least two students:
nb: Velg minimum to studenter:

source: Randomly assign selected students to selected examiners
nb: Tilfeldig tildeling av valgte studenter til valgte rettere

source: Randomly organized students to examiners.
nb: Tilfeldig tildeling av valgte studenter til rettere.

source: You must select at least one examiner.
nb: Du må velge minst en retter.

source: Select examiners:
nb: Velg rettere:

source: Add selected examiners to selected students
nb: Legg valgte rettere til de valgte studentene

source: Added %(count)s students to %(examinernames)s.
nb: La til %(count)s studenter til %(examinernames)s.

source: Replace selected examiners with current examiners for selected students
nb: Erstatt valgte rettere med nåværende rettere for valgte studenter

source: Made %(examinernames)s examiner for %(count)s students, replacing any previous examiners for those students.
nb: Satt %(examinernames)s retter for %(count)s studenter. Eventuelle tidligere rettere ble erstattet for disse studentene.

source: Something went wrong. This may happen if someone else performed a similar operation while you where selecting. Refresh the page and try again
nb: Noe gikk galt. Dette kan skje hvis noen andre utførte en ligende operasjon mens du valgte. Last siden inn på nytt og prøv igjen

source: examiners
nb: rettere

# examiner_bulk_delete_view pagetitle
source: Select examiners
nb: Velg rettere

# examiner_bulk_delete_view pageheading
source: Select examiners
nb: Velg rettere

# assignment_group_multiselect_list_filter_view page_subheading
source: Select the examiners you want to remove.
nb: Velg rettere du vil fjerne.

source: examiner
nb: retter

source: Only department admins have permission to edit examiners for fully anonymous assignments.
nb: Kun avdelingsadministratorer har tillatelse til å redigere rettere for fullt anonymiserte oppgaver.

source: No students to remove.
nb: Ingen studenter å flytte.

source: Removed %(count)s students.
nb: Fjernet %(count)s studenter.

source: Removed %(groupcount)s project group with %(studentcount)s students.
nb: Fjernet %(groupcount)s prosjektgruppe med %(studentcount)s studenter.

source: The grade to points table must have at least 2 rows. The first row must have 0 as points.
nb: Tabellen med poeng for karaktersetting må minst ha 2 rader. Den første raden må ha 0 som poeng.

source: The grade to points table has points that is larger than the maximum number of points.
nb: Tabellen med poeng for karaktersetting har poeng som er høyere enn maksimalt antall poeng.

source: Must be larger than the minimum number of points required to pass.
nb: Må være større enn minimum antall poeng som kreves for å bestå.

# assignment config
source: Examiner chooses
nb: Retter velger

# assignment config
source: Students see
nb: Studenter se

# assignment config
source: Minimum number of points required to pass
nb: Minimum antall poeng nødvendig for å bestå

# assignment config
source: Points awarded for passing grade
nb: Poeng gitt for bestått karakter

# assignment config
source: Maximum number of points
nb: Maksimalt antall poeng

# assignment config
source: The maximum number of points possible for this assignment.
nb: Maksimalt antall poeng for denne oppgaven.

# assignment config
source: Edit grading configuration
nb: Rediger karakter konfigurasjon

source: Save
nb: Lagre

source: Saved Grading configuration for assignment
nb: Lagret karakter konfigurasjon for oppgave

source: Manually pass students
nb: Godkjenn studenter manuelt

source: Manually select students that has passed this assignment, or it's equivalent, on a previous semester. This is for simplifying bulk-passing students on an assignment for an admin, you don't actually select a semester.
nb: Velg studenter manuelt som har bestått denne oppgaven, eller en oppgave denne erstatter, fra et tidligere semester. Dette er for at en administrator lett skal kunne godkjenne denne oppgaven for studenter uten å sette seg selv om retter, man velger ikke et semester.

source: Automatically pass students from an earlier semester
nb: Automatisk godkjenn studenter fra et tidligere semester

source: Automatically pass students from earlier semester by selecting the semester you want to get the results from. This requires that the assignment has the same shortname as the previous assignment.
nb: Automatisk godkjenn studenter fra et tidligere semester ved å velge semester du vil hente resultater fra. Det kreves at oppgaven sitt "kort navn" er det samme som "kort navnet" på oppgaven fra et tidligere semester.

source: Select the earliest semester you want to approve for
nb: Velg det tidligste semesteret du vil godkjenne for

source: Confirm assignments
nb: Bekreft oppgaver

source: Approve assignments
nb: Godkjenn oppgaver

source: Confirm
nb: Bekreft

source: Some students does not qualify to pass the assignment.
nb: Noen studenter kvalifiserer ikke til å bestå oppgaven.

source: No students are qualified to get approved for this assignment from a previous assignment.
nb: Ingen studenter kvalifiserer til å få godkjent på denne oppgaven på grunn av en tidligere oppgave.

source: An error occurred.
nb: En feil oppstod.

source: %(students)s was marked as approved for this assignment.
nb: %(students)s ble markert som godkjent for denne oppgaven.

source: Pass students
nb: Godkjenn studenter

source: Students to pass
nb: Studenter som skal godkjennes

source: Add a general comment to the feedback
nb: Legg til en general kommentar i tilbakemeldingen

source: Delivery has been corrected. Passed in a previous semester.
nb: Denne oppgaven er rettet. Bestått i et tidligere semester.

source: Feedback comment text
nb: Tilbakemeldingstekst

source: There are no students on this assignment.
nb: Det er ingen studenter på denne oppgaven.

source: Bulk pass students
nb: Bulk-godkjenn studenter

# admin create_groups
source: Select students from %(subject)s %(period)s
nb: Velg studenter fra %(subject)s %(period)s

# admin create_groups
source: Select students from %(assignment)s
nb: Velg studenter fra %(assignment)s

# admin create_group
source: Add students to %(assignment)s
nb: Legg studenter til %(assignment)s

# admin create_group
source: Add students
nb: Legg til studenter

# admin create_group
source: Please select how you would like to add students. You will get a preview of your choice on the next page before any students are added.
nb: Vennligst velg hvordan du ønsker å legge til studenter. Du får se en forhåndsvisning av valget ditt på neste side, før det legges til noen studenter.

# admin create_groups
source: Oups! Something went wrong. This may happen if someone edited students on the assignment or the semester while you were making your selection. Please try again.
nb: Ops! Noe gikk galt. Dette kan skje hvis noen andre redigerer studenter tilhørende oppgaven eller semesteret samtidig som du gjorde dine valg. Vennligst prøv igjen.

source: All students on %(assignment)s
nb: Alle studenter i %(assignment)s

source: Students with passing grade on %(assignment)s
nb: Studenter med bestått karakter på %(assignment)s

source: All students on %(period)s
nb: Alle studenter i %(period)s

# admin create_groups
source: Confirm that you want to add the following students to %(assignment)s
nb: Bekreft at du vill legge til de følgende studentene i %(assignment)s

# admin create_groups
source: Add students
nb: Legg til studenter

# admin create_groups
source: Select the students you want to add to %(assignment)s
nb: Velg studenter som du vil legge til %(assignment)s

# admin delete_groups
source: Manually
nb: Velg manuelt

# admin delete_groups
source: You can delete some students on this assignment, or all of them
nb: Du kan slette noen studenter på oppgaven, eller alle

# admin delete_groups
source: Students that failed %(assignment)s
nb: Studenter som ikke bestod %(assignment)s

# admin delete_groups
source: Delete students that did not pass %(assignment)s
nb: Slett studenter som ikke bestod %(assignment)s

# admin delete_group
source: Delete students from %(assignment)s
nb: Slett studenter fra %(assignment)s

# admin delete_group
source: Please select how you would like to delete students. You will get a preview of your choice on the next page before any students are deleted.
nb: Vennligst velg hvordan du ønsker å slette til studenter. Du får se en forhåndsvisning av valget ditt på neste side før det slettes til noen studenter.

source: Delete the following students:
nb: Slett følgende studenter:

source: Deleted %(count)s students from this assignment.
nb: Slettet %(count)s studenter fra denne oppgaven.

# admin delete_groups
source: Oups! Something went wrong. This may happen if someone edited students on the assignment or the semester while you were making your selection. Please try again.
nb: Ops! Noe gikk galt. Dette kan skje hvis noen andre redigerer studenter tilhørende oppgaven eller semesteret samtidig som du gjorde dine valg. Vennligst prøv igjen.

# admin delete_groups
source: Confirm that you want to delete students that failed %(from_assignment_name)s
nb: Bekreft at du vill slette studenter som ikke bestod %(from_assignment_name)s
