Repository: KuroiAme/devilry-django
Catalog: devilry/locale/*/LC_MESSAGES/django.po
Languages: nb

source: Subject
nb: Kurs

source: Period
nb: Semester

source: Assignment
nb: Oppgave

source: Devilry core
nb: Devilry kjerne

source: Deleted user
nb: Slettet bruker

source: User removed from semester
nb: Bruker fjernet fra semester

source: assignment
nb: oppgave

source: assignments
nb: oppgaver

source: Publishing time
nb: Publiseringstidspunkt

source: The time when the assignment is to be published (visible to students and examiners).
nb: Tidspunktet når oppgaven skal publiseres (gjøres synlig for både studenter og rettere).

# assignment anonymizationmode
source: OFF. Normal assignment where semester and course admins can see everything, and examiners and students can see each others names and contact information.
nb: AV. Normal oppgave hvor semesteradministrator og kursadministrator kan se alt. Rettere og studenter kan se hverandres navn og kontaktinformasjon.

# assignment anonymizationmode
source: SEMI ANONYMOUS. Students and examiners can not see information about each other. Comments added by course admins are not anonymized. Semester admins do not have access to the assignment in the admin UI. Course admins have the same permissions as for "OFF".
nb: HALVT ANONYMISERT. Studenter og rettere kan ikke se informasjon om hverandre. Kommentarer lagt til av kursadministrator blir ikke anonymisert. Semesteradministrator har ikke tilgang til oppgaven i admin UI. Kursadministrator har samme tillatelser som for "AV" modusen.

# assignment anonymizationmode
source: FULLY ANONYMIZED. Intended for exams where course admins are examiners. Students and examiners can not see information about each other. Hidden from semester admins. Course admins can not view grading details. Only departmentadmins and superusers can change this back to another "anoymization mode" when feedback has been added to the assignment. Course admins can not edit examiners after the first feedback is provided.
nb: HELT ANONYMISERT. Tiltenkt for eksamener hvor kursadiministrator også er retter. Studenter og rettere kan ikke se informasjon om hverandre. Skjult for semesteradministrator. Kursadiministrator kan ikke se karakterresultatene. Når det er blitt gitt tilbakemeldinger er det kun avdelingsadministrator eller superbruker som kan endre modus fra "helt anonymisert" og til en annen. Når første tilbakemelding er blitt gitt kan ikke kursadiministrator redigere rettere.

# assignment anonymizationmode
source: off
nb: av

# assignment anonymizationmode
source: semi anonymous
nb: semi-anonymisert

# assignment anonymizationmode
source: fully anonymized
nb: helt anonymisert

source: Anonymization mode
nb: Anonymiseringsmodus

# assignment
source: Students can see points?
nb: Studenter kan se poengene?

source: This option controls what types of deliveries this assignment accepts. See the Delivery documentation for more info.
nb: Dette alternativer kontrollerer hvilke typer av innleveringer som aksepteres for oppgaven. Se dokumentasjonen til Delivery for mer informasjon.

source: Deadline handling
nb: Håndtering av innleveringsfrister

source: Soft deadlines
nb: Myke innleveringsfrister

source: Hard deadlines
nb: Harde innleveringsfrister

source: With HARD deadlines, students will be unable to make deliveries when a deadline has expired. With SOFT deadlines students will be able to make deliveries after the deadline has expired. All deliveries after their deadline are clearly highligted. NOTE: Devilry is designed from the bottom up to gracefully handle SOFT deadlines. Students have to perform an extra confirm-step when adding deliveries after their active deadline, and assignments where the deadline has expired is clearly marked for both students and examiners.
nb: Med HARDE innleveringsfrister, er det ikke mulig for studenter å levere etter innleveringsfristen. Med MYKE innleveringsfrister kan studenter levere etter innleveringsfristen. Alle innleveringer etter fristen er tydelig markert. MERK: Devilry er designet for å håndtere MYKE innleveringsfrister på en fornuftig måte. Studenter må gjennom et ekstra steg for å bekrefte at de ønsker å levere etter fristen, og oppgaver der innleveringsfristen har gått ut er tydelig markert for både rettere og studenter.

source: Percent to scale points on this assignment by for period overviews. The default is 100, which means no change to the points.
nb: Prosent for å skalere poeng for denne oppgaven etter periodeoversikt. Stander er 100, som betyr ikke noen endringer for poengene.

# assignment points-to-grade mapper
source: Passed or failed
nb: Bestått eller ikke bestått

# assignment points-to-grade mapper
source: Points
nb: Poeng

# assignment points-to-grade mapper
source: Lookup in a table defined by you (A-F, and other grading systems)
nb: Du definerer en tabell for oppslag (A-F eller andre karaktersystemer)

# assignment grading plugin
source: PASSED/FAILED. The examiner selects passed or failed.
nb: BESTÅTT/IKKE BESTÅTT. Retteren velger bestått eller ikke bestått.

# assignment grading plugin
source: POINTS. The examiner types in the number of points to award the student(s) for this assignment.
nb: POENG. Retteren skriver inn antall poeng som tildeles student(er) for denne oppgaven.

source: Students can create project groups?
nb: Studenter kan lage prosjektgrupper?

source: Select this if students should be allowed to join/leave groups. Even if this is not selected, you can still organize your students in groups manually.
nb: Velg dette hvis studenter skal kunne bli med i/forlage grupper på eget initiativ. Selv om dette ikke er valgt, kan du organisere studentene dine i grupper manuelt.

source: Students can not create project groups after
nb: Studenter kan ikke lage prosjektgrupper etter

source: Students can not create project groups after this time. Ignored if "Students can create project groups" is not selected.
nb: Studenter kan ikke lage prosjektgrupper etter dette tidspunktet. Ignoreres dersom "Studenter kan lage prosjektgrupper" ikke er valgt.

source: Feedback workflow
nb: Arbeidsflyt for tilbakemelding

source: Simple - Examiners write feedback, and publish it whenever they want. Does not handle coordination of multiple examiners at all.
nb: Enkel - Rettere skriver tilbakemelding og publiserer det når de ønsker. Absolutt ingen håndtering av koordinasjon for flere retter.

source: Trusted cooperative feedback editing - Examiners can only save feedback drafts. Examiners share the same feedback drafts, which means that one examiner can start writing feedback and another can continue. When an administrator is notified by their examiners that they have finished correcting, they can publish the drafts via the administrator UI. If you want one examiner to do the bulk of the work, and just let another examiner read it over and adjust the feedback, make the first examiner the only examiner, and reassign the students to the other examiner when the first examiner is done.
nb: Klarert kooperativ redigering av tilbakemelding - Rettere kan kun lagre kladder av tilbakemeldinger. Retter delere de samme kladdene av tilbakemeldinger, noe som betyr at en retter kan begynne å skrive en tilbakemelding og andre kan fortsette. Når en administrator får melding fra retterene om at de er ferdig med å korrigere, kan de publisere kladden vi UI for administrator. Hvis du vil at en retter skal gjøre mesteparten av arbeidet, og en annen retter bare lese over og justere tilbakemeldingene, gjør den første retteren til den eneste retteren og tildel studentene på nytt til den andre retteren når den først er ferdig med sitt arbeide.

# assignment grade passed-or-failed
source: failed
nb: ikke bestått

# assignment grade passed-or-failed
source: passed
nb: bestått

source: First deadline must be within %(periodname)s, which lasts from %(start_time)s to %(end_time)s.
nb: Første innleveringsfrist må være mellom %(periodname)s, som varer fra %(start_time)s til %(end_time)s.

source: Publishing time must be within %(periodname)s, which lasts from %(start_time)s to %(end_time)s.
nb: Publiseringstidspunkt må være i løpet av %(periodname)s, som varer fra %(start_time)s til %(end_time)s.

source: The minumum number of points required to pass must be less than the maximum number of points possible for the assignment. The current maximum is %(max_points)s.
nb: Minimum antall poeng som kreves for å bestå må vøre mindre enn maksimum antall poeng tilgjengelig for oppgaven. Nåværende maksimum er %(max_points)s.

source: The assignment has students. You can not copy use this on assignments with students.
nb: Oppgaven har studenter. Du kan ikke kopiere og bruke dette på oppgaver med studenter.

source: No deadlines
nb: Ingen innleveringsfrister

source: Corrected
nb: Rettet

source: Closed without feedback
nb: Lukket uten tilbakemelding

source: Waiting for something
nb: Venter på noe

# core assignmentgroup
source: no students in group
nb: ingen studenter i gruppen

# core assignmentgroup
source: group#%(groupid)s - no students in group
nb: gruppe#%(groupid)s - ingen studenter i gruppen

source: Cannot merge self into target, self and target is not part of same AssignmentGroup
nb: Kan ikke flette seg selv med målet, seg selv og målet er ikke en del av samme oppgave gruppe (AssignmentGroup)

source: Cannot merge less than 2 groups
nb: Kan ikke flette mindre enn 2 grupper

source: Path
nb: Vei

source: Administrators
nb: Administrator

source: Short name
nb: Kort navn

source: Up to 20 letters of lowercase english letters (a-z), numbers, underscore ("_") and hyphen ("-"). Used when the name takes too much space.
nb: Opp til 20 bokstaver med engelske bokstaver (a-z), tall, understrek("_") og bindestrek("-"). Benyttes når navn tar for mye plass.

source: Can only contain numbers, lowercase letters, '_' and '-'.
nb: Kan kun bestå av nummer, små bokstaver, '_' og '-'.

source: Name
nb: Navn

source: Unknown.
nb: Ukjent.

source: Examiner gave the student another chance.
nb: Retter gav studenten en ny mulighet.

source: Time of delivery
nb: Innleveringstid

source: Deadline
nb: Innleveringsfrist

source: The selected student is not eligible to join the group.
nb: Den valgte studenten er ikke kvalifisert til å bli med i gruppen.

source: The user sending an invite must be a Candiate on the group.
nb: Brukeren som sender en invitasjon må være en Kandidat for gruppen.

source: The student is already a member of the group.
nb: Studenten er allerede medlem av gruppen.

source: The student is already invited to join the group, but they have not responded yet.
nb: Studenten har allerede blitt invitert til gruppen, men har ikke svart enda.

source: Creating project groups without administrator approval is not allowed on this assignment anymore. Please contact you course administrator if you think this is wrong.
nb: Å lage prosjektgrupper uten godkjenning fra administrator er ikke lenger mulig på denne oppgaven. Vennligst ta kontakt med din kursadministrator dersom du tror dette er feil.

source: This assignment does not allow students to form project groups on their own.
nb: Denne oppgaven lar ikke studenter lage prosjektgrupper på egenhånd.

source: The invited student is not registered on this assignment.
nb: Den inviterte studenten er ikke registrert på denne oppgaven.

source: The invited student is already in a project group with more than 1 students.
nb: Den inviterte studenten er allerede med i en prosjektgruppe med mer enn 1 student.

source: This invite has already been accepted.
nb: Invitasjonen har tidligere blitt akseptert.

source: This invite has already been declined.
nb: Invitasjonen har tidligere blitt avvist.

source: {user} accepted your project group invite
nb: {user} aksepterte invitasjonen til din prosjektgruppe

source: {user} rejected your project group invite
nb: {user} avslo invitasjonen til din prosjektgruppe

source: Can not send notification for an accepted GroupInvite.
nb: Kan ikke send en melding til en akseptert gruppeinvitasjon.

source: Can not send notification for an unsaved GroupInvite.
nb: Kan ikke sende en melding til en gruppe invitasjon som ikke er lagret.

source: Project group invite for {assignment}
nb: Invitasjon til prosjektgruppe for {assignment}

source: semesters
nb: semestre

source: Start time and end time defines when the period is active.
nb: Start- og slutt-tid definerer når en periode er aktiv.

source: Start time
nb: Start-tid

source: End time
nb: Slutt-tid

source: Start time must be before end time.
nb: Start-tidspunktet må være før slutt-tidspunktet.

source: Field cannot be blank.
nb: Felt kan ikke være blankt.

source: The smallest entry in the map must have minimum points set to 0 (current value is {minimum_points}).
nb: Den laveste verdien i tabellen må ha minimum poengsum satt til 0 (nåværende verdi er {minimum_points}).

source: {grade} occurs multiple times in the map. A grade must be unique within the map.
nb: {grade} forekommer flere ganger i tabellen. En karakter må være unik i tabellen.

source: Can not have values in the grade table that is larger than maximum number of points.
nb: Kan ikke ha verdier i karaktertabellen som er større enn maksimalt antall poeng.

source: Automatic anonymous ID missing
nb: Automatisk anonym ID mangler

source: You are not allowed to give more than {max_points} points on this assignment.
nb: Du kan ikke gi mer enn {max_points} poeng på denne oppgaven.

source: course
nb: kurs

source: courses
nb: kurs

source: %(sent_to_displayname)s accepted the invite to join your project group for %(subject)s %(assignment)s
nb: %(sent_to_displayname)s godtok invitasjonen til din prosjektgruppe for %(subject)s %(assignment)s

source: %(sent_by_displayname)s invited you to join their project group for %(subject)s %(assignment)s. Accept or reject the offer here:
nb: %(sent_by_displayname)s har invitert deg til sin prosjektgruppe for %(subject)s %(assignment)s. Godta eller avslå tilbudet her:

source: %(sent_to_displayname)s rejected the invite to join your project group for %(subject)s %(assignment)s
nb: %(sent_to_displayname)s avslo invitasjonen til din prosjektgruppe for %(subject)s %(assignment)s

source: %(commentcount)s comment from student.
nb: %(commentcount)s kommentar fra student.

source: %(filecount)s file from student.
nb: %(filecount)s fil fra student.

source: %(commentcount)s comment from examiner.
nb: %(commentcount)s kommentar fra retter.

source: %(commentcount)s unpublished comment from you.
nb: %(commentcount)s upublisert kommentar fra deg.

source: passed
nb: bestått

source: failed
nb: ikke bestått

# group status
source: corrected
nb: korrigert

# group status
source: waiting for feedback
nb: venter på tilbakemelding

# group status
source: waiting for deliveries
nb: venter på innleveringer

# core assignmentgroup
source: no examiner(s)
nb: ingen retter(e)

source: NO EXAMINERS
nb: INGEN RETTERE

source: Examiners
nb: Rettere

source: NO STUDENTS
nb: INGEN STUDENTER

source: Students
nb: Studenter

source: Inactive
nb: Inaktiv

source: Password
nb: Passord

source: Raw passwords are not stored, so there is no way to see this user's password, but you can change the password using <a href="password/">this form</a>.
nb: Rå passord lagers ikke, så det er ingen måte å se denne brukerens passord, men du kan endre passordet ved å gå til <a href="password/">dette skjemaet</a>.

source: Users
nb: Brukere

source: Devilry account
nb: Devilry konto

source: Account
nb: Konto

source: superuser status
nb: superbrukerstatus

source: Designates that this user has all permissions without explicitly assigning them.
nb: Tilordner alle tillatelser til denne brukeren uten å tilordne tillatelsene eksplisitt.

source: The short name for the user. This is set automatically to the email or username depending on the method used for authentication.
nb: Det korte navnet til brukeren. Dette settes automatisk til enten e-post eller brukernavn, avhengig av autentifikasjonsmetode.

source: Full name
nb: Fullt navn

source: Last name
nb: Etternavn

source: date joined
nb: innmeldt dato

source: Suspension time
nb: Suspensasjon tidspunkt

source: Time when the account was suspended
nb: Tidspunkt for når kontoen ble suspendert

source: Reason for suspension
nb: Årsak til suspensjon

source: Preferred language
nb: Foretrukket språk

source: User
nb: Bruker

source: Can not provide a reason for suspension when suspension time is blank.
nb: Kan ikke angi en årsak for suspensjonen når tidspunktet for supensasjonen er blankt.

source: Short name is required.
nb: Kort navn er påkrevd.

source: Email address
nb: E-postadresse

source: Email addresses
nb: E-postadresser

source: Email
nb: Epost

source: Send notifications to this email address?
nb: Send melding til denne e-postadressen?

source: Is this your primary email?
nb: Er dette din primære e-post?

source: No
nb: Nei

source: Yes
nb: Ja

source: Your primary email is the email address used when we need to display a single email address.
nb: Din primære e-post er e-postadressen som benyttes hvis vi trener å vise en enkel e-postadresse.

source: %(email)s - User%(userid)s#%(userhortname)s
nb: %(email)s - Bruker%(userid)s#%(userhortname)s

source: Username
nb: Brukernavn

source: Usernames
nb: Brukernavn

source: Is this your primary username?
nb: Er dette ditt primære brukernavn?

source: Your primary username is shown alongside your full name to identify you to teachers, examiners and other students.
nb: Ditt primære brukernavn vises ved siden av ditt fulle navn for å identifisere deg for lærere, rettere og andre studenter.

source: %(username)s - User%(userid)s
nb: %(username)s - Bruker%(userid)s

source: Permission group user
nb: Tillatelsesgruppe bruker

source: Permission group users
nb: Tillatelsesgruppe brukere

source: %(user)s in group %(permissiongroup)s
nb: %(user)s i gruppe %(permissiongroup)s

source: Department administrator group
nb: Avdelingadministratorgruppe

source: Course administrator group
nb: Kurseadministratorgruppe

source: Semester administrator group
nb: Semesteradministratorgruppe

source: Permission group
nb: Tillatelsesgruppe

source: A unique name for this group.
nb: Et unikt navn for den gruppen.

source: Created time
nb: Opprettet tidspunkt

source: The time when this group was created.
nb: Tidspunktet for når gruppen ble opprettet.

source: Last updated time
nb: Tidspunkt for siste oppdatering

source: The time when this group last updated.
nb: Tidspunktet for når gruppen sist ble oppdatert.

source: Last updated from syncsystem time
nb: Sist oppdater fra synkroniserings-systemet sin tid

source: The time when this group last updated from a third party sync system.
nb: Tidspunktet for når gruppen sist ble oppdatert fra et tredjeparts-synkroniseringssystem.

source: Permission group type
nb: Tillatelsesgruppe type

source: Course and semester administrator groups can only be assigned to a single course or semester. Department administrator groups can be assigned to multiple courses. You can not change this for existing permission groups.
nb: Grupper av kurs- og semesteradministratorer kan bare tildeles til ett enkelt kurs eller semester. Grupper av avdelingsadministratorer kan tildeles flere kurs. Du kan ikke endre dette for eksisterende tillatelsesgrupper.

source: Custom manageable?
nb: Tilpasset redigering?

source: Is this group mageable by non-superusers. Can not be enabled for department administrator groups.
nb: Er denne gruppen administrert av ikke-superbrukere? Kan ikke aktiveres for grupper av avdelingsadministratorer.

source: Users in this group
nb: Brukere i denne gruppen

source: Department administrator groups can not be custom manageable.
nb: Administratorgrupper for avdeling kan ikke tilpasses ytterlig.

source: Permission group type can not be changed.
nb: Type tilgangsgruppe kan ikke endres.

source: Semester permission group
nb: Tillatelsesgruppe for semester

source: Semester permission groups
nb: Tillatelsesgrupper for semester

source: Semester administrators for %(period)s
nb: Semesteradministratorer for %(period)s

source: Only semesters can be added to semester administrator permission groups.
nb: Kun semestre kan legges til i tillatelsesgruppen for semesteradministratorer.

source: Only a single editable permission group is allowed for a semester.
nb: Kun en redigerbar tillatelsesgruppe er tillat for et semster.

source: Course permission group
nb: Tillatelsesgruppe for kurs

source: Course permission groups
nb: Tillatelsesgruppe for kurs

source: Course administrators for %(subject)s
nb: Kursadministratorer for %(subject)s

source: Courses can only be added to course and department administrator permission groups.
nb: Kurs kan kun bli lagt til kurs og tillatelsesgrupper for avdelingsadministrator.

source: Only a single editable permission group is allowed for a course.
nb: Kun en redigerbar tillatelsesgruppe er tillat for et kurs.

source: Account overview
nb: Kontooversikt

source: Name not registered for account
nb: Navn er ikke registrert for kontoen

source: Shown instead of your name some places in the UI
nb: Vises i stedet for ditt navn noen steder i UI

source: Last login
nb: Sist innlogget

source: use for notifications
nb: bruk for meldinger

source: Language
nb: Språk

source: Change language
nb: Endre språk

source: Sign out
nb: Logg ut

source: Language options
nb: Språkvalg

source: Current language
nb: Nåværende språk

source: No examiners found matching your filters/search.
nb: Ingen rettere samsvarer med dine filtre/søk.

# tag
source: Student(s) has tag
nb: Student(er) har tag

# tag
source: Examiner(s) has tag
nb: Retter(e) har tag

source: Email descending
nb: E-post synkende

source: Username descending
nb: Brukernavn synkende

source: Name descending
nb: Navn synkende

source: Last name descending
nb: Etternavn synkende

# orderby
source: Sort
nb: Sorter

# listfilter relateduser
source: Is active?
nb: Er aktiv?

source: Search
nb: Søk

source: Search listed objects ...
nb: Søk i utlistede objekter ...

# period tag show hidden filter
source: Show hidden tags?
nb: Vis skjulte tags?

# period tag show hidden radio filter
source: Show tags
nb: Vis tags

source: show all tags
nb: vis alle tags

source: hidden tags only
nb: kun skjulte tags

source: visible tags only
nb: kun synlige tags

source: custom tags only
nb: kun tilpassede tags

source: imported tags only
nb: kun importerte tags

# tag
source: Has tag
nb: Har tag

# admin multiselect2_relatedstudent
source: Selected students
nb: Valgte studenter

# admin multiselect2_relatedstudent
source: No students selected
nb: Ingen studenter valgt

source: Add students to %(examiner)s
nb: Legg studenter til %(examiner)s

source: Back to examiner detail page
nb: Tilbake til detaljsiden for retter

source: Manually add examiners
nb: Legg til rettere manuelt

source: Back to bulk-organize examiners overview
nb: Tilbake til oversikt for bulk-organisering av rettere

source: Select one or more students and select the examiners you want to add as examiners for the selected students.
nb: Velg en eller flere studenter og velg retterene du ønsker å legge til som rettere for de valgte studentene.

source: Manually replace examiners
nb: Erstatt rettere manuelt

source: Select one or more students and select the examiners you want to set as the new examiners for the selected students.
nb: Velg en eller flere studenter og velg retterene som du vil sette som nye rettere for de valgte studentene.

source: Warning:
nb: Advarsel:

source: This will replace any examiners currently assigned to the selected students.
nb: Dette vil erstatte alle rettere som nå er tildelt de valgte studentene.

source: Will be added to groups:
nb: Vil bli lagt til gruppene:

source: Back to overview
nb: Tilbake til oversikt
