Repository: KuroiAme/devilry-django
Catalog: devilry/locale/*/LC_MESSAGES/django.po
Languages: nb

# admin delete_groups
source: Delete students
nb: Slett studenter

# admin group multiselect submit
source: Something went wrong. This may happen if changes was made to the selected students while you where working on them. Please try again.
nb: Et eller annet gikk galt. Dette kan skje hvis noen andre gjorde endringer på de valgte studentene samtidig som du arbeidet med de. Vennligst prøv igjen.

source: Create project group
nb: Opprett prosjektgruppe

source: A group with %(what)s has been created!
nb: En gruppe med %(what)s har blitt opprettet!

source: students
nb: studenter

# admin replace_groups
source: You can not use the replace students wizard on a published assignment. You can still add new students and remove students without feedback or deliveries.
nb: Du kan ikke benytte veiviseren for å erstatte studenter på en publisert oppgave. Du kan fortsatt legge til og fjerne studenter uten tilbakemeldinger eller leveringer.

# admin create_group
source: Replace students on %(assignment)s
nb: Erstatt studenter for %(assignment)s

# admin create_group
source: Replace students
nb: Erstatt studenter

# admin create_group
source: Please select how you would like to add students. Your current students for this assignment will be removed, but you will not be able to remove students with deliveries or feedback. You will get a preview of your choice on the next page before any students are added.
nb: Vennligst velg hvordan du ønsker å legge til studenter. Dine nåværende studenter tilknyttet denne oppgaven vil bli fjernet, såfremt de ikke har leveringer eller kommentarer. Du får se en forhåndsvisning av valget ditt på neste side, før det legges til noen studenter.

# admin create_groups
source: Confirm that you want to remove the current students on %(assignment)s and replace them with the students shown below
nb: Bekreft at nåværende studenter tilknyttet %(assignment)s skal fjernes og erstattes med studentene som vises nedenfor

# admin create_groups
source: Replace students
nb: Erstatt studenter

source: Split
nb: Del

source: student is not part of project group
nb: studenten er ikke en del av prosjektgruppen

source: Cannot split student if there is less than 2 students in project group.
nb: Kan ikke dele studenter hvis det er færre en 2 studenter i en prosjektgruppe.

source: %(what)s was removed from the project group
nb: %(what)s ble fjernet fra prosjektgruppen

source: Type or paste in email addresses separated by comma (","), space or one user on each line.
nb: Skriv eller lim in e-postadressene adskilt med komma(","), mellomrom eller en bruker per linje.

source: Type or paste in usernames separated by comma (","), space or one user on each line.
nb: Skriv eller lim in e-brukernavnene adskilt med komma(","), mellomrom eller en bruker per linje.

source: Invalid email addresses: %(emails)s
nb: Ugyldige e-postadresser: %(emails)s

source: Invalid usernames: %(usernames)s
nb: Ugyldige brukernavn: %(usernames)s

source: Type the name of your course.
nb: Skriv inn navnet for ditt kurs.

source: Example: DUCK1010 Object Oriented Programming
nb: Eksempel: DUCK1010 Object Oriented Programming

source: Example: duck1010
nb: Eksempel: duck1010

source: Short Name
nb: Kort navn

source: Short Name (descending)
nb: Kort navn (synkende)

source: Assignments for %(user_shortname)s
nb: Oppgaver for %(user_shortname)s

# devilry_admin studentfeedbackfeed wizard search users
source: Search users...
nb: Søk i brukere...

# devilry_admin studentfeedbackfeed wizard search assignments
source: Search assignments...
nb: Søk i oppgaver...

# group in active semester filter
source: Active semesters?
nb: Aktive semestre?

# orderby_deadline
source: Deadline ordering
nb: Innleveringsfrist

# orderby_deadline
source: Deadline (ascending)
nb: Innleveringsfrist (stigende)

# orderby_deadline
source: Deadline (descending)
nb: Innleveringsfrist (synkende)

source: Select a student
nb: Velg en student

source: Add selected users as semester admins
nb: Legg til valgte brukere som semesteradministratorer

source: Added %(usernames)s.
nb: La til %(usernames)s.

source: Remove semester administrator: %(user)s?
nb: Fjern semesteradministrator: %(user)s?

source: Are you sure you want to remove %(user)s as semester administrator for %(period)s? You can re-add a removed administrator at any time.
nb: Er du sikker på at du vil fjerne %(user)s as semester administrator for %(period)s? Du kan når som helst legge til igjen en fjernet administrator.

source: %(user)s is no longer semester administrator for %(period)s.
nb: %(user)s er ikke lengre semesteradministrator for %(period)s.

source: Type the name of your assignment.
nb: Skriv inn navnet for din oppgave.

source: Up to 20 letters of lowercase english letters (a-z), numbers, underscore ("_") and hyphen ("-").
nb: Opp til 20 bokstaver med engelske bokstaver (a-z), tall, understrek("_") og bindestrek("-").

source: Choose how you would like to set up students for the new assignment. You can add all students from the semester, no students or copy students and examiners from previous assignments.
nb: Velg hvordan du vil sette opp studenter på den nye oppgaven. Du kan legge til alle studenter fra semesteret, ingen studenter eller kopiere studenter og rettere fra tidligere oppgaver.

# CrAdmin datetime picker typo fix
source: Select a date/time
nb: Velg tidspunkt

source: Set first deadline
nb: Sett første innleveringsfrist

source: The first deadline for this assignment. This is shared by all the students on the assignment.
nb: Den første innleveringsfristen for denne oppgaven. Dette er delt mellom alle studentene på denne oppgaven.

source: All students on semester
nb: Alle studenter på semesteret

source: Copy all students
nb: Kopier alle studenter

source: Copy students with passing grade
nb: Studenter med karakteren bestått

source: First deadline must be at least %(delay)s.
nb: Første innleveringsfrist må minst være %(delay)s.

source: Example: Assignment 1
nb: Eksempel: Oppgave 1

source: Example: assignment1
nb: Eksempel: oppgave1

source: Something went wrong
nb: Noe gikk galt

source: Will import all students on the semester if any.
nb: Importerer alle studenter på semesteret.

source: Will not import any students. You have to manually configure students from the assignment-dashboard.
nb: Studenter vil ikke bli importert. Du må manuelt legge til studenter på oppgaven via oppgave-siden.

source: Copy all students from this assignment. This will copy the group and examiner setup from the selected assignment.
nb: Kopier alle studenter fra denne oppgaven. Dette vil kopiere over gruppeoppsett og rettere fra den valgte oppgaven.

source: Copy students from this assignment with passing grade only. This will copy the group and examiner setup from the selected assignment.
nb: Kopier alle studenter fra denne oppgaven med karakteren bestått. Dette vil kopiere over gruppeoppsett og rettere fra den valgte oppgaven.

source: Edit %(period)s
nb: Rediger %(period)s

source: Deactivate examiner: %(user)s?
nb: Deaktiver retter: %(user)s?

source: Are you sure you want to make %(user)s an inactive examiner for %(period)s? Inactive examiners can not access any assignments within the semester. You can re-activate a deactivated examiner at any time.
nb: Er du sikker på at du vil sette %(user)s som inaktiv retter for %(period)s? Inaktive rettere får ikke tilgang til oppgaver innenfor semesteret. Du kan når som helst reaktivere en inaktiv retter.

source: Deactivate
nb: Deaktiver

source: %(user)s was deactivated.
nb: %(user)s ble deaktivert.

source: Re-activate examiner: %(user)s?
nb: Reaktiver retter: %(user)s?

source: Please confirm that you want to re-activate %(user)s.
nb: Vennligst bekreft at du ønsker å reaktivere %(user)s.

source: %(user)s was re-activated.
nb: %(user)s ble reaktivert.

source: Add selected examiners
nb: Legg til valgte rettere

source: Bulk import examiners
nb: Bulk-import av rettere

source: Added %(count)s new examiners to %(period)s.
nb: La til %(count)s nye rettere for %(period)s.

source: No new examiners was added.
nb: Det ble ikke lagt til nye rettere.

source: %(count)s users was already examiner on %(period)s.
nb: %(count)s brukere var allerede rettere for %(period)s.

source: Tags on %(what)s
nb: Tags tilhørende %(what)s

# TagListBuilderListView get_no_items_message
source: No period tags
nb: Ingen tags for perioden

source: Enter tags here. Tags must be in a comma separated format, e.g: tag1, tag2, tag3. Each tag may be up to 15 characters long.
nb: Skriv tags her. Tags må være adskilt med komma, f.eks: tag1, tag2, tag3. Hver tag kan ha en lengde på 15 tegn.

source: Tag field is empty.
nb: Tag-felt er tomt.

source: Wrong format. Example: tag1, tag2, tag3
nb: Feil format. Eksempel: tag1, tag2, tag3

source: One or more tags exceed the limit of 15 characters.
nb: En eller flere tags er lengre en grensen på 15 tegn.

source: "%(what)s" occurs more than once in the form.
nb: "%(what)s" forekommer fler enn en gang i skjemaet.

source: The tag(s) you wanted to add already exists.
nb: Tag(s) du ønsket å legge til eksisterer allerede.

source: %(created)d tag(s) added
nb: %(created)d tag(s) lagt til

source: , %(excluded)d tag(s) already existed and were ignored.
nb: , %(excluded)d tag(s) eksisterer allerede og ble ignorert.

source: Tag name
nb: Navn på tag

source: Rename the tag here. Up to 15 characters. Can contain any character except comma(,)
nb: Her gir du nytt navn til tag. Opp til 15 tegn. Kan inneholde hvilket som helst tegn unntatt komma(,)

source: Tag cannot be empty.
nb: Tag kan ikke være tomt.

source: %(what)s already exists
nb: %(what)s eksisterer allerede

source: Tag contains a comma(,).
nb: Tag inneholder komma(,).

source: Edit %(what)s
nb: Rediger %(what)s

source: Tag successfully edited.
nb: Vellykket redigering av tag.

source: Invalid user was selected. This may happen if someone else added or removed one or more of the available users while you were selecting. Please try again.
nb: Ugyldig bruker ble valgt. Dette kan skje hvis noen andre la til eller fjerne en eller flere tilgjengelige brukere samtidig som du gjorde dine valg. Vennligst prøv igjen.

# admin multiselect2_relateduser
source: Selected %(what)s
nb: Valgte %(what)s

# admin multiselect2_relateduser
source: No %(what)s selected
nb: Ingen %(what)s valgt

source: Add %(user)s to %(tag)s
nb: Legg %(user)s til %(tag)s

source: %(number_users)d %(user_string)s added successfully.
nb: %(number_users)d %(user_string)s lagt til med suksess.

source: Remove %(user)s from %(tag)s
nb: Fjern %(user)s fra %(tag)s

source: %(number_users)d %(user_string)s removed successfully
nb: %(number_users)d %(user_string)s fjernet med suksess

source: Invalid examiner was selected.
nb: Ugyldig retter ble valgt.

source: Invalid student was selected.
nb: Ugyldig student ble valgt.

source: All students results
nb: Resultater for alle studenter

source: No students on period
nb: Ingen studenter for perioden

source: Students qualified for exams
nb: Studenter kvalifisert til eksamen

source: There is no students registered for %(what)s.
nb: Det er ingen studenter registrert for %(what)s.

source: Add as student
nb: Legg til som student

source: Please select the user you want to add as students for %(what)s
nb: Vennligst velg brukerne du vil legge til som studenter for %(what)s

source: Deactivate student: %(user)s?
nb: Deaktiver student: %(user)s?

source: Are you sure you want to make %(user)s an inactive student for %(period)s? Inactive students can not be added to new assignments, but they still have access to assignments that they have already been granted access to. Inactive students are clearly marked with warning messages throughout the student, examiner and admin UI, but students and examiners are not notified in any way when you deactivate a student. You can re-activate a deactivated student at any time.
nb: Er du sikker på at du vil sette %(user)s som inaktiv student for %(period)s? Inaktive studenter kan ikke bli lagt til nye oppgaver, men de har fortsatt adgang til oppgaver hvor de allerede har blitt gitt tilgang. Inaktive studenter er tydelig markert med advarselsmeldinger gjennom UI for student, retter og administrator, men studenter og retter blir ikke varslet på noen som helst måte når du deaktiverer en student. Du kan når som helst reaktivere en deaktivert student.

source: Re-activate student: %(user)s?
nb: Reaktiver student: %(user)s?

source: Add selected students
nb: Legg til valgte studenter

source: Bulk import students
nb: Bulk-import av studenter

source: Added %(count)s new students to %(period)s.
nb: La til %(count)s nye studenter for %(period)s.

source: No new students was added.
nb: Det ble ikke lagt til nye studenter.

source: %(count)s users was already student on %(period)s.
nb: %(count)s brukere var allerede studenter for %(period)s.

source: Add selected users as course admins
nb: Legg til valgte brukere som kursadministratorer

source: Remove course administrator: %(user)s?
nb: Fjern kursadministrator: %(user)s?

source: Are you sure you want to remove %(user)s as course administrator for %(subject)s? You can re-add a removed administrator at any time.
nb: Er du sikker på at du vil fjerne %(user)s som kursadministrator for %(subject)s? Du kan når som helst legge til en fjernet administrator.

source: %(user)s is no longer course administrator for %(subject)s.
nb: %(user)s er ikke lengre kursadministrator for %(subject)s.

source: Type the name of your semester.
nb: Skriv inn navnet for ditt semester.

source: Example: Spring 2025
nb: Eksempel: Spring 2025

source: Example: spring2025
nb: Eksempel: spring2025

source: Edit %(subject)s
nb: Rediger %(subject)s

source: How would you like to sign in?
nb: Hvordan ønsker du å logge inn?

source: Devilry login
nb: Devilry innlogging

source: Are you sure you want to sign out?
nb: Er du sikker på at du vil logge ut?

source: Sign Out
nb: Logg ut

source: New user e-mails
nb: Ny bruker e-post

source: Enter list of e-mails for new users
nb: Skriv in e-postliste for nye brukere

source: Submit
nb: Send inn

source: in progress
nb: pågår

source: finished
nb: ferdig

source: Update all candidate IDs and anonymous IDs.
nb: Oppdater alle kandidat ID'er og anonyme ID'er.

# comment user_role_choices
source: Examiner
nb: Retter

# comment user_role_choices
source: Admin
nb: Administrator

# compressed archive meta role
source: Examiner
nb: Retter

# compressed archive meta role
source: Admin
nb: Administrator

source: backend_id must refer to a valid backend
nb: backend_id må referer til en gyldig backend

source: Selected students:
nb: Valgte studenter:

source: No students selected
nb: Ingen studenter valgt

source: Name (descending)
nb: Navn (synkende)

source: First deadline (newest first)
nb: Første innleveringsfrist (nyeste først)

source: First deadline (oldest first)
nb: Første innleveringsfrist (eldste først)

source: Publishing time (newest first)
nb: Publiseringstidspunkt (nyeste først)

source: Publishing time (oldest first)
nb: Publiseringstidspunkt (eldste først)

# orderby
source: By points
nb: Etter poeng

# orderby
source: Points (highest first)
nb: Poeng (høyeste først)

# orderby
source: Points (lowest first)
nb: Poeng (laveste først)

# orderby
source: By activity
nb: Etter aktivitet

# orderby
source: Recently commented by student
nb: Nylig kommentert av student

# orderby
source: Least recently commented by student
nb: Eldste kommentar av student

# orderby
source: Recently commented by examiner
nb: Nylig kommentert av retter

# orderby
source: Least recently commented by examiner
nb: Eldste kommentar av retter

# orderby
source: By student name
nb: Etter student navn

# orderby
source: Email
nb: E-post

# orderby
source: Email (descending)
nb: E-post (synkende)

# orderby
source: Username
nb: Brukernavn

# orderby
source: Username (descending)
nb: Brukernavn (synkende)

# orderby
source: Name
nb: Navn

# orderby
source: Name (descending)
nb: Navn (synkende)

# orderby
source: Last name
nb: Etternavn

# orderby
source: Last name (descending)
nb: Etternavn (synkende)

# orderby
source: Anonymous ID
nb: Anonym ID

# orderby
source: Anonymous ID (descending)
nb: Anonym ID (synkende)

# orderby
source: Candidate ID
nb: Kandidat ID

# orderby
source: Candidate ID (descending)
nb: Kandidat ID (synkende)

# group status
source: all students
nb: alle studenter

# group points filter
source: Points
nb: Poeng

# group is passing grade filter
source: Passing grade?
nb: Ståkarakter?

# group examiner filter
source: Examiner
nb: Retter

# exact candidate num
source: Exactly
nb: Akkurat

# less than candidate num
source: Less than
nb: Mindre enn

# greater than candidate num
source: Greater than
nb: Mer enn

# group examiner filter
source: Number of examiners
nb: Antall rettere

# group student filter
source: Number of students
nb: Antall studenter

# group activity
source: Activity
nb: Aktivitet

# group activity
source: From student
nb: Fra student

# group activity
source: Has comment(s) from student
nb: Har kommentar(er) fra student

# group activity
source: Has file(s) from student
nb: Har fil(er) fra student

# group activity
source: No comments from student
nb: Ingen kommentar fra student

# group activity
source: No files from student
nb: Ingen filer fra student

# group activity
source: From examiner
nb: Fra retter

# group activity
source: Has comment(s) from examiner
nb: Har kommentar(er) fra retter

# group activity
source: Has unpublished feedback draft
nb: Har kladd av upublisert tilbakemelding

# group activity
source: Has unpublished comment(s) from YOU
nb: Har upubliserte kommentar(er) fra DEG

# group activity
source: No comments from examiner
nb: Ingen kommentar fra retter

# group activity
source: From administrator
nb: Fra administrator

# group activity
source: Has comment(s) from administrator
nb: Har kommentar(er) fra administrator

source: Found %(result_num)s of %(total_num)s %(object_name)s
nb: Fant %(result_num)s av %(total_num)s %(object_name)s

# admin multiselect2_users
source: Selected users
nb: Valgte brukere

# admin multiselect2_users
source: No users selected
nb: Ingen brukere valgt

source: Heading
nb: Overskrift

source: Text here
nb: Tekst her

source: Bold
nb: Fet

source: Italic
nb: Kursiv

source: Write the URL in the field below. Make sure you include the http:// or https:// part of the URL.
nb: Skriv inn URL i feltet under. Pass på at du inkluderer http:// eller https:// delen i URL.

source: Link title here
nb: Lenke tittel her

source: Link
nb: Lenke

source: Bulletlist
nb: Punktliste

source: Numbered list
nb: Ordna liste

source: programminglanguage
nb: programmeringsspråk

source: Code block
nb: Kodeblokk

source: Unpublished feedback draft
nb: Kladd av upublisert tilbakemelding

# group grade
source: Grade
nb: Karakter

source: %(assignmentcount)s assignment
nb: %(assignmentcount)s oppgave

source: Qualified for final exam
nb: Kan gå opp til eksamen

source: NOT qualified for final exam
nb: Kan IKKE gå opp til avsluttende eksamen

source: No users in permission group
nb: Ingen brukere tillatelsesgruppen

# devilry attempt number
source: first attempt
nb: første forsøk

# devilry attempt number
source: second attempt
nb: andre forsøk

# devilry attempt number
source: third attempt
nb: tredje forsøk

# devilry attempt number
source: fourth attempt
nb: fjerde forsøk

# devilry attempt number
source: %(attempt_number)sst attempt
nb: %(attempt_number)sst forsøk

source: Back to deadline-overview
nb: Tilbake til oversikt for frist

source: Important info
nb: Viktig informasjon

source: group(s) excluded
nb: ekskludert(e) gruppe(er)

source: Groups that have been corrected was excluded.
nb: Rettede grupper ble ekskludert.

source: Groups that have not yet been corrected was excluded.
nb: Grupper som ennå ikke er rettet ble ekskludert.

source: Move deadline
nb: Flytt innleveringsfrist

source: New attempt
nb: Nytt forsøk

source: for all groups
nb: til alle grupper

source: for some groups
nb: til noen grupper

source: %(deadline)s (Assignment first deadline)
nb: %(deadline)s (Oppgavens første innleveringsfrist)

# deadline_list_view select_deadline
source: Select deadline to manage
nb: Velg innleveringsfrist som skal administreres

# deadline_list_view select_deadline
source: Select deadline
nb: Velg innleveringsfrist

# deadline_list_view select_deadline
source: Please choose how you would like to manage the deadline.
nb: Vennligst velg hvordan du vil administrere innleveringsfristen.

source: Add a suitable comment describing why the the deadline was changed.
nb: Legg til en passende kommentar som beskriver hvorfor innleveringsfristen ble endret.

source: Comment Text
nb: Kommentar tekst

source: New deadline
nb: Ny innleveringsfrist

source: Pick a date and time from the calendar, or select one of the suggested deadlines.
nb: Velg dato og tid fra kalenderen, eller en av de foreslåtte innleveringsfristene.

source: Manage deadline %(deadline)s
nb: Håndter innleveringsfristen %(deadline)s

source: Give new attempt
nb: Gi et nytt forsøk

source: Deadline managed for %(group_names)s
nb: Innleveringsfrist endret for %(group_names)s

source: groups
nb: grupper

# assignment_group_target_renderer move_dealine_text
source: Move deadline for selected %(what)s
nb: Flytt innleveringsfrist for valgt %(what)s

# assignment_group_target_renderer submit_button_text
source: Continue with selected %(what)s
nb: Fortsett med valgte %(what)s

# assignment_group_target_renderer with_items_title
source: Selected %(what)s
nb: Valgte %(what)s

# assignment_group_target_renderer without_items_text
source: No %(what)s selected
nb: Ingen %(what)s valgt

# assignment_group_multiselect_list_filter_view pagetitle
source: Select groups
nb: Velg grupper

# assignment_group_multiselect_list_filter_view pageheading
source: Select groups
nb: Velg grupper

# assignment_group_multiselect_list_filter_view page_subheading
source: Select the groups you want to manage the deadline for.
nb: Velg grupper hvor du vil redigere innleveringsfristen.

source: A student added a new comment AFTER THE DEADLINE for %(assignment_name)s
nb: En student har lagt til en ny kommentar ETTER FRISTEN på %(assignment_name)s

source: A student added a new delivery/comment for %(assignment_name)s
nb: En student har lagt til en ny innlevering/kommentar på %(assignment_name)s

source: An examiner added a new comment for %(assignment_name)s
nb: En retter har lagt til en ny kommentar på %(assignment_name)s

source: An admin added a new comment for %(assignment_name)s
nb: En administrator har lagt til en ny kommentar på %(assignment_name)s

source: You added a new comment AFTER THE DEADLINE for %(assignment_name)s
nb: Du la til en ny kommentar ETTER FRISTEN på %(assignment_name)s

source: You added a new delivery/comment for %(assignment_name)s
nb: Du la til en ny innlevering/kommentar på %(assignment_name)s

source: New attempt for %(assignment_name)s
nb: Nytt forsøk for %(assignment_name)s

source: Deadline moved for %(assignment_name)s
nb: Tidsfrist flyttet for %(assignment_name)s

source: Feedback for %(assignment_name)s
nb: Tilbakemelding for %(assignment_name)s

source: Feedback updated for %(assignment_name)s
nb: Tilbakemelding oppdatert for %(assignment_name)s

# devilry comment email
source: Assignment
nb: Oppgave

# devilry comment email
source: Added by
nb: Lagt til av

# devilry comment email
source: Added datetime
nb: Tidspunkt

# devilry comment email
source: Uploaded files
nb: Opplastede filer

# devilry comment email
source: See the delivery feed for more details
nb: Se leveringsoversikten for flere detaljer

source: The deadline for %(assignment_name)s has been moved.
nb: Tidsfrist for %(assignment_name)s har blitt flyttet.
